{
    "posts": [
        {
            "id": "10bfa018-c88d-4f1b-b66c-5dbcf414da78",
            "en": {
                "name": "Ignition System ",
                "content": "The ignition system is a crucial component in an internal combustion engine, responsible for igniting the air-fuel mixture to start the engine and keep it running. There are several types of ignition systems, but they all serve the same basic purpose. Below is an overview of the main components and functions of a typical ignition system:",
                "mainComponents": "1.\tBattery: Provides the electrical power needed to start the engine.\n2.\tIgnition Coil: Converts the low-voltage power from the battery to high-voltage power.\n3.\tDistributor: Distributes the high-voltage power to the spark plugs in the correct firing order.\n4.\tSpark Plugs: Ignite the air-fuel mixture in the engine's cylinders.\n5.\tIgnition Switch: Allows the driver to turn the ignition system on and off.\n6.\tControl Module: Manages the timing and operation of the ignition system.\n",
                "functions": "1.\tVoltage Transformation: The ignition coil transforms the low voltage from the battery to the high voltage required to create a spark.\n2.\tSpark Timing: The control module or distributor ensures that the spark occurs at the right time for each cylinder.\n3.\tSpark Distribution: The distributor or control module sends the high-voltage spark to the correct spark plug.\n4.\tIgnition: The spark plugs ignite the air-fuel mixture, causing combustion and powering the engine.\n",
                "images": [
                    "https://firebasestorage.googleapis.com/v0/b/automotive-fe630.appspot.com/o/images%2F78def142-1243-4577-beb2-085d0d2ed4d0_picture1.png?alt=media&token=1908f21b-2c0c-4a3d-86a1-ef03b0ce1fa3",
                    "https://firebasestorage.googleapis.com/v0/b/automotive-fe630.appspot.com/o/images%2Fe6f4412b-a503-4114-bdca-00814b76136c_q.png?alt=media&token=65e73051-de8d-408f-8d1e-d32e3d667e21"
                ]
            },
            "vi": {
                "name": "HỆ THỐNG ĐÁNH LỬA",
                "content": "Hệ thống đánh lửa là một thành phần quan trọng trong động cơ đốt trong, chịu trách nhiệm đốt cháy hỗn hợp không khí-nhiên liệu để khởi động động cơ và duy trì hoạt động của nó. Có nhiều loại hệ thống đánh lửa, nhưng tất cả đều phục vụ mục đích cơ bản giống nhau. Dưới đây là tổng quan về các thành phần chính và chức năng của một hệ thống đánh lửa điển hình:",
                "mainComponents": "1.\tẮc Quy: Cung cấp năng lượng điện cần thiết để khởi động động cơ.\n2.\tCuộn Đánh Lửa: Chuyển đổi nguồn điện áp thấp từ ắc quy thành điện áp cao.\n3.\tBộ Phân Phối Điện: Phân phối điện áp cao đến các bugi theo thứ tự đánh lửa chính xác.\n4.\tBugi: Đốt cháy hỗn hợp không khí-nhiên liệu trong các xi lanh của động cơ.\n5.\tCông Tắc Đánh Lửa: Cho phép người lái bật và tắt hệ thống đánh lửa.\n6.\tBộ Điều Khiển: Quản lý thời điểm và hoạt động của hệ thống đánh lửa.",
                "functions": "1.\tBiến Đổi Điện Áp: Cuộn đánh lửa biến đổi điện áp thấp từ ắc quy thành điện áp cao cần thiết để tạo ra tia lửa.\n2.\tĐiều Chỉnh Thời Gian Đánh Lửa: Bộ điều khiển hoặc bộ phân phối đảm bảo rằng tia lửa xảy ra đúng thời điểm cho mỗi xi lanh.\n3.\tPhân Phối Tia Lửa: Bộ phân phối hoặc bộ điều khiển gửi tia lửa điện áp cao đến bugi đúng.\n4.\tĐánh Lửa: Các bugi đốt cháy hỗn hợp không khí-nhiên liệu, gây ra sự cháy và tạo năng lượng cho động cơ.",
                "images": [
                    "https://firebasestorage.googleapis.com/v0/b/automotive-fe630.appspot.com/o/images%2F78def142-1243-4577-beb2-085d0d2ed4d0_picture1.png?alt=media&token=1908f21b-2c0c-4a3d-86a1-ef03b0ce1fa3",
                    "https://firebasestorage.googleapis.com/v0/b/automotive-fe630.appspot.com/o/images%2Fe6f4412b-a503-4114-bdca-00814b76136c_q.png?alt=media&token=65e73051-de8d-408f-8d1e-d32e3d667e21"
                ]
            }
        },
        {
            "id": "1a4cf6cb-beb9-4e87-b689-5db5b12da317",
            "en": {
                "name": "Brake System",
                "content": "The brake system is an essential safety feature in any vehicle, responsible for slowing down or stopping the vehicle. The effectiveness and reliability of the brake system are critical for vehicle safety. Below is an overview of the main components and functions of a typical brake system:",
                "mainComponents": "1.\tBrake Pedal: The driver applies force to the brake pedal to initiate the braking process.\n2.\tMaster Cylinder: Converts the force from the brake pedal into hydraulic pressure.\n3.\tBrake Lines: Carry the hydraulic fluid from the master cylinder to the brake calipers or wheel cylinders.\n4.\tBrake Calipers: Clamp the brake pads against the rotors to create friction and slow down the vehicle (in disc brake systems).\n5.\tBrake Pads: Create friction against the rotors to slow down the vehicle.\n6.\tBrake Rotors: The discs that the brake pads clamp onto to create the necessary friction.\n7.\tBrake Drums: Used in drum brake systems; the brake shoes press against the drum to create friction.\n8.\tBrake Shoes: Press against the brake drums to slow down the vehicle.\n9.\tBrake Fluid: The hydraulic fluid that transmits force from the master cylinder to the brake calipers or wheel cylinders.\n10.\tAnti-lock Braking System (ABS): Prevents the wheels from locking up during hard braking to maintain steering control.",
                "functions": "1.\tForce Transmission: The brake pedal applies force to the master cylinder, creating hydraulic pressure.\n2.\tHydraulic Pressure Distribution: The master cylinder distributes hydraulic pressure through the brake lines to the calipers or wheel cylinders.\n3.\tFriction Generation: The brake pads or shoes create friction against the rotors or drums to slow down the vehicle.\n4.\tHeat Dissipation: The rotors and drums dissipate heat generated during braking to prevent overheating.\n5.\tSafety Enhancement: The ABS system enhances safety by preventing wheel lock-up and maintaining vehicle control during hard braking.",
                "images": [
                    "https://firebasestorage.googleapis.com/v0/b/automotive-fe630.appspot.com/o/images%2Fd9014122-4829-42a6-88f7-38ced73d7466_q.png?alt=media&token=dff68283-f122-4c7d-bcf1-2678f7f07eda",
                    "https://firebasestorage.googleapis.com/v0/b/automotive-fe630.appspot.com/o/images%2F6836d665-9fdd-427d-a84e-74d819c59065_s.png?alt=media&token=8ae7783a-8ec8-480d-98b0-1b0cec64a562"
                ]
            },
            "vi": {
                "name": "HỆ THỐNG PHANH",
                "content": "Hệ thống phanh là một tính năng an toàn quan trọng trong bất kỳ phương tiện nào, chịu trách nhiệm làm chậm hoặc dừng xe. Hiệu quả và độ tin cậy của hệ thống phanh là cực kỳ quan trọng đối với sự an toàn của phương tiện. Dưới đây là tổng quan về các thành phần chính và chức năng của một hệ thống phanh điển hình:",
                "mainComponents": "1.\tBàn Đạp Phanh: Người lái xe tác động lực lên bàn đạp phanh để bắt đầu quá trình phanh.\n2.\tXi Lanh Chính: Chuyển đổi lực từ bàn đạp phanh thành áp suất thủy lực.\n3.\tĐường Dẫn Phanh: Chuyển dẫn chất lỏng thủy lực từ xi lanh chính đến các caliper hoặc xi lanh bánh xe.\n4.\tCaliper Phanh: Kẹp các má phanh vào các đĩa phanh để tạo ra ma sát và làm chậm xe (trong hệ thống phanh đĩa).\n5.\tMá Phanh: Tạo ma sát với các đĩa phanh để làm chậm xe.\n6.\tĐĩa Phanh: Các đĩa mà má phanh kẹp vào để tạo ra ma sát cần thiết.\n7.\tTrống Phanh: Được sử dụng trong hệ thống phanh tang trống; các guốc phanh ép vào trống để tạo ma sát.\n8.\tGuốc Phanh: Ép vào trống phanh để làm chậm xe.\n9.\tDầu Phanh: Chất lỏng thủy lực truyền lực từ xi lanh chính đến các caliper hoặc xi lanh bánh xe.\n10.\tHệ Thống Chống Bó Cứng Phanh (ABS): Ngăn chặn các bánh xe bị khóa cứng trong quá trình phanh mạnh để duy trì khả năng điều khiển lái.",
                "functions": "1.\tTruyền Lực: Bàn đạp phanh tác động lực lên xi lanh chính, tạo ra áp suất thủy lực.\n2.\tPhân Phối Áp Suất Thủy Lực: Xi lanh chính phân phối áp suất thủy lực qua các đường dẫn phanh đến các caliper hoặc xi lanh bánh xe.\n3.\tTạo Ma Sát: Các má phanh hoặc guốc phanh tạo ma sát với các đĩa phanh hoặc trống phanh để làm chậm xe.\n4.\tTản Nhiệt: Các đĩa phanh và trống phanh tản nhiệt được tạo ra trong quá trình phanh để tránh quá nhiệt.\n5.\tNâng Cao An Toàn: Hệ thống ABS nâng cao an toàn bằng cách ngăn chặn khóa bánh xe và duy trì khả năng kiểm soát xe trong quá trình phanh mạnh.",
                "images": [
                    "https://firebasestorage.googleapis.com/v0/b/automotive-fe630.appspot.com/o/images%2Fd9014122-4829-42a6-88f7-38ced73d7466_q.png?alt=media&token=dff68283-f122-4c7d-bcf1-2678f7f07eda",
                    "https://firebasestorage.googleapis.com/v0/b/automotive-fe630.appspot.com/o/images%2F6836d665-9fdd-427d-a84e-74d819c59065_s.png?alt=media&token=8ae7783a-8ec8-480d-98b0-1b0cec64a562"
                ]
            }
        },
        {
            "id": "dfb9244e-7d99-4507-9655-b773614b3bb9",
            "en": {
                "name": "Brake System",
                "content": "The brake system is an essential safety feature in any vehicle, responsible for slowing down or stopping the vehicle. Effective and reliable braking is critical for the safety of the vehicle and its occupants. Here is an overview of the main components and functions of a typical brake system:",
                "mainComponents": "1.\tBrake Pedal: The driver applies force to the brake pedal to initiate the braking process.\n2.\tMaster Cylinder: Converts the force from the brake pedal into hydraulic pressure.\n3.\tBrake Lines: Carry the hydraulic fluid from the master cylinder to the brake calipers or wheel cylinders.\n4.\tBrake Calipers: Clamp the brake pads against the rotors to create friction and slow down the vehicle (in disc brake systems).\n5.\tBrake Pads: Create friction against the rotors to slow down the vehicle.\n6.\tBrake Rotors: The discs that the brake pads clamp onto to create the necessary friction.\n7.\tBrake Drums: Used in drum brake systems; the brake shoes press against the drum to create friction.\n8.\tBrake Shoes: Press against the brake drums to slow down the vehicle.\n9.\tBrake Fluid: The hydraulic fluid that transmits force from the master cylinder to the brake calipers or wheel cylinders.\n10.\tAnti-lock Braking System (ABS): Prevents the wheels from locking up during hard braking to maintain steering control.",
                "functions": "1.\tForce Transmission: The brake pedal applies force to the master cylinder, creating hydraulic pressure.\n2.\tHydraulic Pressure Distribution: The master cylinder distributes hydraulic pressure through the brake lines to the calipers or wheel cylinders.\n3.\tFriction Generation: The brake pads or shoes create friction against the rotors or drums to slow down the vehicle.\n4.\tHeat Dissipation: The rotors and drums dissipate heat generated during braking to prevent overheating.\n5.\tSafety Enhancement: The ABS system enhances safety by preventing wheel lock-up and maintaining vehicle control during hard braking.",
                "images": [
                    "https://firebasestorage.googleapis.com/v0/b/automotive-fe630.appspot.com/o/images%2F80a16334-5b7a-410b-9993-ff25e625e5d9_ascas.png?alt=media&token=bb5c6b7b-bb58-4b9e-ba8b-2d2c758cd608",
                    "https://firebasestorage.googleapis.com/v0/b/automotive-fe630.appspot.com/o/images%2F7001a221-0b2c-4118-b0cd-ff2c345e2cd8_asdqw.png?alt=media&token=713d8c43-7c92-4dc7-a5a0-1d7bfae2fc7a"
                ]
            },
            "vi": {
                "name": "PHANH XE",
                "content": "Hệ thống phanh là một tính năng an toàn quan trọng trong bất kỳ phương tiện nào, chịu trách nhiệm làm chậm hoặc dừng xe. Hiệu quả và độ tin cậy của hệ thống phanh là cực kỳ quan trọng đối với sự an toàn của phương tiện và hành khách. Dưới đây là tổng quan về các thành phần chính và chức năng của một hệ thống phanh điển hình:",
                "mainComponents": "1.\tBàn Đạp Phanh: Người lái xe tác động lực lên bàn đạp phanh để bắt đầu quá trình phanh.\n2.\tXi Lanh Chính: Chuyển đổi lực từ bàn đạp phanh thành áp suất thủy lực.\n3.\tĐường Dẫn Phanh: Chuyển dẫn chất lỏng thủy lực từ xi lanh chính đến các caliper hoặc xi lanh bánh xe.\n4.\tCaliper Phanh: Kẹp các má phanh vào các đĩa phanh để tạo ra ma sát và làm chậm xe (trong hệ thống phanh đĩa).\n5.\tMá Phanh: Tạo ma sát với các đĩa phanh để làm chậm xe.\n6.\tĐĩa Phanh: Các đĩa mà má phanh kẹp vào để tạo ra ma sát cần thiết.\n7.\tTrống Phanh: Được sử dụng trong hệ thống phanh tang trống; các guốc phanh ép vào trống để tạo ma sát.\n8.\tGuốc Phanh: Ép vào trống phanh để làm chậm xe.\n9.\tDầu Phanh: Chất lỏng thủy lực truyền lực từ xi lanh chính đến các caliper hoặc xi lanh bánh xe.\n10.\tHệ Thống Chống Bó Cứng Phanh (ABS): Ngăn chặn các bánh xe bị khóa cứng trong quá trình phanh mạnh để duy trì khả năng điều khiển lái.",
                "functions": "1.\tTruyền Lực: Bàn đạp phanh tác động lực lên xi lanh chính, tạo ra áp suất thủy lực.\n2.\tPhân Phối Áp Suất Thủy Lực: Xi lanh chính phân phối áp suất thủy lực qua các đường dẫn phanh đến các caliper hoặc xi lanh bánh xe.\n3.\tTạo Ma Sát: Các má phanh hoặc guốc phanh tạo ma sát với các đĩa phanh hoặc trống phanh để làm chậm xe.\n4.\tTản Nhiệt: Các đĩa phanh và trống phanh tản nhiệt được tạo ra trong quá trình phanh để tránh quá nhiệt.\n5.\tNâng Cao An Toàn: Hệ thống ABS nâng cao an toàn bằng cách ngăn chặn khóa bánh xe và duy trì khả năng kiểm soát xe trong quá trình phanh mạnh.",
                "images": [
                    "https://firebasestorage.googleapis.com/v0/b/automotive-fe630.appspot.com/o/images%2F80a16334-5b7a-410b-9993-ff25e625e5d9_ascas.png?alt=media&token=bb5c6b7b-bb58-4b9e-ba8b-2d2c758cd608",
                    "https://firebasestorage.googleapis.com/v0/b/automotive-fe630.appspot.com/o/images%2F7001a221-0b2c-4118-b0cd-ff2c345e2cd8_asdqw.png?alt=media&token=713d8c43-7c92-4dc7-a5a0-1d7bfae2fc7a"
                ]
            }
        },
        {
            "id": "1dfa7aca-1c32-4e04-8058-0bbee4c394e3",
            "en": {
                "name": "Catalytic Converter",
                "content": "A catalytic converter is an essential component of a vehicle's exhaust system, designed to reduce harmful emissions produced by the engine. It helps to convert toxic pollutants into less harmful emissions before they are released into the atmosphere. Here is an overview of the main components and functions of a typical catalytic converter:",
                "mainComponents": "1.\tCatalyst Substrate: Usually made of a ceramic or metallic honeycomb structure, providing a large surface area for the catalytic reactions.\n2.\tCatalytic Coating: Contains precious metals like platinum, palladium, and rhodium that facilitate the chemical reactions.\n3.\tOxygen Sensors: Monitor the oxygen levels in the exhaust gases to ensure optimal operation of the catalytic converter.\n4.\tHeat Shield: Protects the catalytic converter and surrounding components from the high temperatures generated during operation.",
                "functions": "1.\tReduction of Nitrogen Oxides (NOx): The catalytic converter reduces NOx emissions by breaking them down into nitrogen and oxygen.\n2.\tOxidation of Carbon Monoxide (CO): It converts carbon monoxide, a harmful gas, into carbon dioxide, which is less harmful.\n3.\tOxidation of Hydrocarbons (HC): Unburned hydrocarbons in the exhaust are converted into carbon dioxide and water.\n4.\tEmission Control: Overall, the catalytic converter helps in controlling the emissions of harmful gases, contributing to cleaner air and meeting regulatory standards.",
                "images": [
                    "https://firebasestorage.googleapis.com/v0/b/automotive-fe630.appspot.com/o/images%2F85f10f93-43d0-4440-9adb-e2eea7073eca_ascascwq.png?alt=media&token=374ea08b-d1b4-4a39-ab26-c58cee83c635",
                    "https://firebasestorage.googleapis.com/v0/b/automotive-fe630.appspot.com/o/images%2Fee95a713-dc21-45c7-9395-2400029210bb_qwd.png?alt=media&token=b04f5196-8208-4d1c-8369-26fffeaba47e"
                ]
            },
            "vi": {
                "name": "BỘ CHUYỂN ĐỔI XÚC TÁC",
                "content": "Bộ chuyển đổi xúc tác là một thành phần thiết yếu của hệ thống xả của xe, được thiết kế để giảm thiểu các khí thải độc hại do động cơ sinh ra. Nó giúp chuyển đổi các chất ô nhiễm độc hại thành các khí thải ít độc hại hơn trước khi chúng được thải ra môi trường. Dưới đây là tổng quan về các thành phần chính và chức năng của một bộ chuyển đổi xúc tác điển hình:",
                "mainComponents": "1.\tChất Nền Xúc Tác: Thường được làm từ cấu trúc tổ ong bằng gốm hoặc kim loại, cung cấp diện tích bề mặt lớn cho các phản ứng xúc tác.\n2.\tLớp Phủ Xúc Tác: Chứa các kim loại quý như bạch kim, palladium, và rhodium giúp xúc tác các phản ứng hóa học.\n3.\tCảm Biến Oxy: Giám sát mức độ oxy trong khí thải để đảm bảo hoạt động tối ưu của bộ chuyển đổi xúc tác.\n4.\tTấm Chắn Nhiệt: Bảo vệ bộ chuyển đổi xúc tác và các thành phần xung quanh khỏi nhiệt độ cao được sinh ra trong quá trình hoạt động.\n",
                "functions": "1.\tGiảm Thiểu Oxit Nitơ (NOx): Bộ chuyển đổi xúc tác giảm thiểu NOx bằng cách phá vỡ chúng thành nitơ và oxy.\n2.\tOxy Hóa Carbon Monoxide (CO): Chuyển đổi carbon monoxide, một loại khí độc hại, thành carbon dioxide, ít độc hại hơn.\n3.\tOxy Hóa Hydrocarbon (HC): Các hydrocarbon chưa cháy hết trong khí thải được chuyển đổi thành carbon dioxide và nước.\n4.\tKiểm Soát Khí Thải: Tổng thể, bộ chuyển đổi xúc tác giúp kiểm soát lượng khí thải độc hại, góp phần làm sạch không khí và đáp ứng các tiêu chuẩn quy định.",
                "images": [
                    "https://firebasestorage.googleapis.com/v0/b/automotive-fe630.appspot.com/o/images%2F85f10f93-43d0-4440-9adb-e2eea7073eca_ascascwq.png?alt=media&token=374ea08b-d1b4-4a39-ab26-c58cee83c635",
                    "https://firebasestorage.googleapis.com/v0/b/automotive-fe630.appspot.com/o/images%2Fee95a713-dc21-45c7-9395-2400029210bb_qwd.png?alt=media&token=b04f5196-8208-4d1c-8369-26fffeaba47e"
                ]
            }
        },
        {
            "id": "7bfc9399-92cd-4365-8126-061bdd93b60a",
            "en": {
                "name": "Exhaust System",
                "content": "The exhaust system is a crucial part of a vehicle, responsible for directing exhaust gases away from the engine and out of the vehicle. It plays a vital role in reducing emissions, enhancing engine performance, and minimizing noise. Here is an overview of the main components and functions of a typical automotive exhaust system:",
                "mainComponents": "1.\tExhaust Manifold: Collects exhaust gases from the engine cylinders and directs them into the exhaust pipe.\n2.\tOxygen Sensors: Monitor the level of oxygen in the exhaust gases to help the engine control the air-fuel mixture for optimal combustion.\n3.\tCatalytic Converter: Reduces harmful emissions by converting toxic gases (like carbon monoxide, nitrogen oxides, and hydrocarbons) into less harmful substances (like carbon dioxide and water).\n4.\tExhaust Pipes: Transport exhaust gases from the exhaust manifold through the catalytic converter and muffler, eventually releasing them out of the vehicle.\n5.\tMuffler: Reduces the noise produced by the exhaust gases as they exit the engine.\n6.\tResonator: Works with the muffler to further reduce noise and can also help in tuning the exhaust sound.\n7.\tTailpipe: The final section of the exhaust system, where the exhaust gases are released into the atmosphere.\n",
                "functions": "1.\tEmission Control: Reduces harmful pollutants from the exhaust gases to meet environmental regulations.\n2.\tNoise Reduction: Minimizes the noise produced by the exhaust gases through the muffler and resonator.\n3.\tEngine Performance: Enhances engine efficiency by effectively managing the flow of exhaust gases.\n4.\tHeat Dissipation: Safely dissipates the heat generated by the exhaust gases away from the engine and vehicle.\n",
                "images": [
                    "https://firebasestorage.googleapis.com/v0/b/automotive-fe630.appspot.com/o/images%2Fd3705dcd-f1fb-4269-99d5-9dd740ac82bd_wdqqwdqw.png?alt=media&token=1c9b12c7-cdf7-49ce-a03a-08b31e445c3c",
                    "https://firebasestorage.googleapis.com/v0/b/automotive-fe630.appspot.com/o/images%2F6f43bb14-27b6-4f4e-8b64-e9cd594217ca_wwqw.png?alt=media&token=ff3872e8-0939-495c-ba8a-b222463001bb"
                ]
            },
            "vi": {
                "name": "ỐNG XẢ",
                "content": "Hệ thống ống xả là một phần quan trọng của xe, chịu trách nhiệm dẫn khí thải ra khỏi động cơ và ra ngoài xe. Nó đóng vai trò quan trọng trong việc giảm khí thải, tăng hiệu suất động cơ và giảm tiếng ồn. Dưới đây là tổng quan về các thành phần chính và chức năng của một hệ thống ống xả ô tô điển hình:",
                "mainComponents": "1.\tỐng Xả Chính: Thu thập khí thải từ các xi lanh động cơ và dẫn chúng vào ống xả.\n2.\tCảm Biến Oxy: Giám sát mức độ oxy trong khí thải để giúp động cơ kiểm soát hỗn hợp nhiên liệu-không khí tối ưu cho quá trình đốt cháy.\n3.\tBộ Chuyển Đổi Xúc Tác: Giảm thiểu khí thải độc hại bằng cách chuyển đổi các khí độc (như carbon monoxide, oxit nitơ và hydrocarbon) thành các chất ít độc hại hơn (như carbon dioxide và nước).\n4.\tỐng Xả: Dẫn khí thải từ ống xả chính qua bộ chuyển đổi xúc tác và ống giảm âm, cuối cùng thải chúng ra khỏi xe.\n5.\tỐng Giảm Âm: Giảm tiếng ồn do khí thải sinh ra khi chúng thoát ra khỏi động cơ.\n6.\tỐng Cộng Hưởng: Hoạt động cùng với ống giảm âm để giảm thêm tiếng ồn và có thể giúp điều chỉnh âm thanh của hệ thống xả.\n7.\tỐng Xả Cuối: Phần cuối cùng của hệ thống xả, nơi khí thải được thải ra môi trường.",
                "functions": "1.\tKiểm Soát Khí Thải: Giảm các chất ô nhiễm độc hại từ khí thải để đáp ứng các quy định về môi trường.\n2.\tGiảm Tiếng Ồn: Giảm tiếng ồn do khí thải sinh ra thông qua ống giảm âm và ống cộng hưởng.\n3.\tTăng Hiệu Suất Động Cơ: Tăng hiệu quả động cơ bằng cách quản lý hiệu quả luồng khí thải.\n4.\tTản Nhiệt: Tản nhiệt an toàn sinh ra từ khí thải ra khỏi động cơ và xe.",
                "images": [
                    "https://firebasestorage.googleapis.com/v0/b/automotive-fe630.appspot.com/o/images%2Fd3705dcd-f1fb-4269-99d5-9dd740ac82bd_wdqqwdqw.png?alt=media&token=1c9b12c7-cdf7-49ce-a03a-08b31e445c3c",
                    "https://firebasestorage.googleapis.com/v0/b/automotive-fe630.appspot.com/o/images%2F6f43bb14-27b6-4f4e-8b64-e9cd594217ca_wwqw.png?alt=media&token=ff3872e8-0939-495c-ba8a-b222463001bb"
                ]
            }
        },
        {
            "id": "30d466ed-d58f-4b8c-9660-aefb4564b6d0",
            "en": {
                "name": "Airbag System",
                "content": "The airbag system is a critical safety feature in vehicles, designed to protect occupants during a collision by providing a cushioning effect. The system rapidly inflates airbags in the event of a crash, reducing the risk of injury. Here is an overview of the main components and functions of a typical airbag system:",
                "mainComponents": "1.\tAirbags: Flexible fabric bags that inflate upon impact to provide a cushioning effect. Common types include frontal airbags, side airbags, curtain airbags, and knee airbags.\n2.\tCrash Sensors: Detect the force and severity of a collision and send signals to the airbag control unit to deploy the airbags.\n3.\tAirbag Control Unit (ACU): The central computer that processes signals from the crash sensors and determines when to deploy the airbags.\n4.\tInflator Units: Contain the gas-generating chemicals that rapidly inflate the airbags upon receiving a signal from the ACU.\n5.\tSeatbelts: Work in conjunction with airbags to restrain occupants and reduce movement during a crash, enhancing the effectiveness of the airbags.\n6.\tWarning Light: Located on the dashboard, it indicates the status of the airbag system and alerts the driver to any malfunctions.\n",
                "functions": "1.\tImpact Detection: Crash sensors detect a collision and send signals to the ACU.\n2.\tAirbag Deployment: The ACU processes the signals and triggers the inflator units to deploy the airbags.\n3.\tOccupant Protection: Inflated airbags provide a cushioning effect, reducing the impact force on occupants and minimizing injury risk.\n4.\tSystem Monitoring: The warning light monitors the airbag system's status and alerts the driver to any issues.\n",
                "images": [
                    "https://firebasestorage.googleapis.com/v0/b/automotive-fe630.appspot.com/o/images%2F2a27fdc1-a9b1-4a80-a85d-791cd0a81203_qwdqwwqd.png?alt=media&token=a500a9aa-1624-459e-87e0-5e46b8ca3df3",
                    "https://firebasestorage.googleapis.com/v0/b/automotive-fe630.appspot.com/o/images%2F5e5bf77c-da69-4f2e-8329-d27e5d63324f_zazqqz.png?alt=media&token=5b9e169e-d5a7-4fa3-a240-1ce8174369f2"
                ]
            },
            "vi": {
                "name": "TÚI KHÍ",
                "content": "Hệ thống túi khí là một tính năng an toàn quan trọng trong các phương tiện, được thiết kế để bảo vệ hành khách trong quá trình va chạm bằng cách cung cấp một hiệu ứng đệm. Hệ thống này nhanh chóng bơm phồng các túi khí trong trường hợp xảy ra tai nạn, giảm nguy cơ chấn thương. Dưới đây là tổng quan về các thành phần chính và chức năng của một hệ thống túi khí điển hình:",
                "mainComponents": "1.\tTúi Khí: Các túi vải mềm dẻo bơm phồng khi va chạm để cung cấp hiệu ứng đệm. Các loại thông thường bao gồm túi khí phía trước, túi khí bên hông, túi khí rèm và túi khí đầu gối.\n2.\tCảm Biến Va Chạm: Phát hiện lực và mức độ nghiêm trọng của va chạm và gửi tín hiệu đến bộ điều khiển túi khí để kích hoạt túi khí.\n3.\tBộ Điều Khiển Túi Khí (ACU): Máy tính trung tâm xử lý tín hiệu từ các cảm biến va chạm và quyết định khi nào cần kích hoạt túi khí.\n4.\tBộ Bơm Phồng Túi Khí: Chứa các hóa chất sinh khí nhanh chóng bơm phồng túi khí khi nhận được tín hiệu từ ACU.\n5.\tDây Đai An Toàn: Hoạt động cùng với túi khí để giữ chặt hành khách và giảm chuyển động trong quá trình va chạm, tăng cường hiệu quả của túi khí.\n6.\tĐèn Cảnh Báo: Nằm trên bảng điều khiển, chỉ báo trạng thái của hệ thống túi khí và cảnh báo người lái về bất kỳ sự cố nào.\n",
                "functions": "1.\tPhát Hiện Va Chạm: Cảm biến va chạm phát hiện va chạm và gửi tín hiệu đến ACU.\n2.\tKích Hoạt Túi Khí: ACU xử lý các tín hiệu và kích hoạt bộ bơm phồng túi khí để bơm phồng túi khí.\n3.\tBảo Vệ Hành Khách: Túi khí bơm phồng cung cấp hiệu ứng đệm, giảm lực tác động lên hành khách và giảm nguy cơ chấn thương.\n4.\tGiám Sát Hệ Thống: Đèn cảnh báo giám sát trạng thái của hệ thống túi khí và cảnh báo người lái về bất kỳ vấn đề nào.\n",
                "images": [
                    "https://firebasestorage.googleapis.com/v0/b/automotive-fe630.appspot.com/o/images%2F2a27fdc1-a9b1-4a80-a85d-791cd0a81203_qwdqwwqd.png?alt=media&token=a500a9aa-1624-459e-87e0-5e46b8ca3df3",
                    "https://firebasestorage.googleapis.com/v0/b/automotive-fe630.appspot.com/o/images%2F5e5bf77c-da69-4f2e-8329-d27e5d63324f_zazqqz.png?alt=media&token=5b9e169e-d5a7-4fa3-a240-1ce8174369f2"
                ]
            }
        },
        {
            "id": "1d7f9954-ef1c-4f85-bd8f-8237de25d592",
            "en": {
                "name": "Suspension System",
                "content": "The car suspension system is a detailed system on the car that supports the entire car body. This is a system with features such as high durability, to ensure the vehicle is sturdy. Car suspension systems also need to ensure the ability to limit strong fluctuations. This will help the car operate more safely and stably. The suspension system helps the wheels move vertically, synchronized with the vehicle's body, helping the vehicle to be less bumpy when moving on the road.",
                "mainComponents": "•\tSuspension: (Treo) The system of springs, shock absorbers, and linkages that connects a vehicle to its wheels, allowing relative motion between the two.\n•\tSpring: (Lò xo) A component of the suspension system that absorbs shocks and supports the weight of the vehicle.\n•\tShock absorber: (Bộ giảm xóc) A device that dampens and absorbs shocks and vibrations.\n•\tControl arm: (Càng xe) A hinged suspension link between the chassis and the wheel, allowing movement and flexibility.\n•\tStrut: (Cần đòn) A structural component of the suspension system, combining the spring and shock absorber into a single unit.\n•\tSway bar (Anti-roll bar): (Thanh cân bằng) A component that reduces body roll and improves stability during cornering.\n•\tSuspension bushing: (Ống lót treo) A rubber or polyurethane component that cushions and isolates suspension parts from chassis vibrations.\n•\tRide height: (Độ cao xe) The vertical distance between the ground and a specified point on the vehicle, often adjustable in modern suspensions.\n•\tIndependent suspension: (Treo độc lập) A suspension system where each wheel is attached to the chassis independently, allowing for better handling and ride quality.\n•\tBeam axle: (Cầu rỗng) A suspension system where both wheels are connected to a single axle, typically found in rear-wheel-drive and some heavy-duty vehicles.\n•\tAir suspension: (Treo khí) A suspension system that uses compressed air to adjust ride height and stiffness.\n•\tActive suspension: (Treo chủ động) A suspension system with sensors and actuators that continuously adjust damping and ride height for optimal performance.\n•\tPassive suspension: (Treo bị động) A basic suspension system with fixed damping and ride height adjustments.",
                "functions": " The car suspension system plays many different roles for the vehicle such as: Bearing the weight of the entire vehicle, helping to absorb shock, creating a smooth feeling when the wheels roll. From the above functions, the wheel will oscillate vertically when moving. This system also helps the wheels generate more friction and have better traction.\n  Thanks to that, the car can easily handle situations such as changing direction, accelerating,... when traveling. The car suspension system also helps the car operate stably and smoothly, ensuring safety and creating the most comfort for the vehicle user.",
                "images": [
                    "https://firebasestorage.googleapis.com/v0/b/automotive-fe630.appspot.com/o/images%2Fa0e4f095-0d3f-40f3-ac9d-aaf45df00900_qwcwwdwax.png?alt=media&token=626b72c2-a54f-446b-ad76-3e28279a12eb",
                    "https://firebasestorage.googleapis.com/v0/b/automotive-fe630.appspot.com/o/images%2Fb81b8ca9-96ae-4879-a831-7c256fb3aa61_zxcczxcs.png?alt=media&token=f11038d4-0bd8-4016-ada7-a9d5c465ccc2"
                ]
            },
            "vi": {
                "name": "HỆ THỐNG TREO",
                "content": "Hệ thống treo ô tô là hệ thống chi tiết trên xe có vai trò nâng đỡ cho toàn bộ phần thân xe. Đây là hệ thống có các đặc điểm như có độ bền cao, nhằm đảm bảo xe được chắc chắn. Các hệ thống treo trên ô tô cũng cần đảm bảo khả năng hạn chế sự dao động mạnh. Điều này sẽ giúp cho ô tô vận hành an toàn và ổn định hơn. Hệ thống treo giúp cho bánh xe chuyển động với phương thẳng đứng, đồng bộ cùng thân xe giúp xe đỡ bị dằn xóc hơn lúc di chuyển trên đường.",
                "mainComponents": "1.\tHệ thống treo: (Treo) Hệ thống lò xo, giảm chấn và các liên kết nối xe với các bánh xe, cho phép chuyển động tương đối giữa hai bánh.\n2.\tLò xo: (Lò xo) Là bộ phận của hệ thống treo có tác dụng hấp thụ chấn động và đỡ trọng lượng của xe.\n3.\tBộ giảm xóc: (Bộ giảm xóc) Là thiết bị làm giảm và hấp thụ các chấn động, rung động.\n4.\tTay điều khiển: (Càng xe) Là bản lề liên kết treo giữa khung xe và bánh xe, cho phép di chuyển linh hoạt.\n5.\tStrut: (Cần đòn) Là bộ phận cấu tạo của hệ thống treo, kết hợp lò xo và bộ giảm xóc thành một khối duy nhất.\n6.\tSway bar (Thanh chống lật): (Thanh cân bằng) Là bộ phận giúp giảm độ lắc của thân xe và cải thiện độ ổn định khi vào cua.\n7.\tỐng lót hệ thống treo: (Ống lót treo) Thành phần cao su hoặc polyurethane có tác dụng đệm và cách ly các bộ phận treo khỏi rung động của khung xe.\n8.\tChiều cao đi xe: (Độ cao xe) Khoảng cách thẳng đứng giữa mặt đất và một điểm xác định trên xe, thường có thể điều chỉnh được trong hệ thống treo hiện đại.\n9.\tHệ thống treo độc lập: (Treo độc lập) Hệ thống treo trong đó mỗi bánh xe được gắn độc lập vào khung xe, cho phép xử lý và chất lượng lái tốt hơn.\n10.\tTrục dầm: (Cầu rỗng) Là hệ thống treo trong đó cả hai bánh được kết nối với một trục duy nhất, thường thấy ở các xe dẫn động cầu sau và một số xe hạng nặng.\n11.\tHệ thống treo khí nén: (Treo khí) Là hệ thống treo sử dụng khí nén để điều chỉnh độ cao và độ cứng của xe.\n12.\tHệ thống treo chủ động: (Treo chủ động) Hệ thống treo với các cảm biến và cơ cấu chấp hành liên tục điều chỉnh giảm xóc và chiều cao xe để đạt hiệu suất tối ưu.\n13.\tHệ thống treo thụ động: (Treo thiết bị động) Hệ thống treo cơ bản với khả năng giảm chấn cố định và điều chỉnh chiều cao xe.\n",
                "functions": "Hệ thống treo ô tô giữ nhiều vai trò khác nhau cho xe như: Chịu tải sức nặng cho toàn xe, giúp giảm xóc, tạo cảm giác êm ái khi bánh lăn. Từ những công năng trên, bánh xe khi di chuyển sẽ dao động theo phương thẳng đứng. Hệ thống này cũng giúp cho bánh xe nảy sinh nhiều ma sát, có độ bám đường tốt hơn.\n\tNhờ đó xe có thể dễ dàng xử lý các tình huống như chuyển hướng, tăng tốc,... khi lưu thông. Hệ thống treo ô tô cũng giúp cho xe hơi vận hành ổn định, êm ái, đảm bảo an toàn và tạo ra sự thoải mái nhất cho người sử dụng xe.\n",
                "images": [
                    "https://firebasestorage.googleapis.com/v0/b/automotive-fe630.appspot.com/o/images%2Fa0e4f095-0d3f-40f3-ac9d-aaf45df00900_qwcwwdwax.png?alt=media&token=626b72c2-a54f-446b-ad76-3e28279a12eb",
                    "https://firebasestorage.googleapis.com/v0/b/automotive-fe630.appspot.com/o/images%2Fb81b8ca9-96ae-4879-a831-7c256fb3aa61_zxcczxcs.png?alt=media&token=f11038d4-0bd8-4016-ada7-a9d5c465ccc2"
                ]
            }
        },
        {
            "id": "d26faeb7-0e09-4a7d-bdd2-f76b85b68411",
            "en": {
                "name": "Wheel Drive System",
                "content": "A car's 4-wheel drive system is a system that transmits energy from the engine to the wheels to help the vehicle move. Equipping a suitable drive system will help the engine operate more powerfully. Depending on technical requirements, the vehicle can be equipped with a 1-wheel drive system (2 wheels) or 2 wheels (4 wheels). In this article, we will learn more about the four-wheel drive type in more detail.",
                "mainComponents": "•\tDrivetrain: (Hệ thống dẫn động) The components that transmit power from the engine to the wheels of a vehicle.\n•\tEngine: (Động cơ) The component of a vehicle that generates power by burning fuel.\n•\tTransmission: (Hộp số) A device that transfers power from the engine to the wheels, allowing the vehicle to change speed and direction.\n•\tClutch: (Lá côn) A device that engages and disengages the transmission from the engine to allow for gear changes.\n•\tDifferential: (Bộ chia tốc) A component that allows wheels to rotate at different speeds while providing equal torque.\n•\tAxle: (Trục cầu) A shaft on which a wheel rotates, often part of the drivetrain.\n•\tTransfer case: (Hộp đổi số) A device that distributes power from the transmission to front and rear axles in four-wheel-drive vehicles.\n•\tDrive shaft: (Trục dẫn động) A rotating shaft that transmits torque from the engine to the differential or axle.\n•\tAll-wheel drive (AWD): (Dẫn động bốn bánh) A drivetrain system that sends power to all four wheels of a vehicle for improved traction and stability.\n•\tFour-wheel drive (4WD): (Dẫn động bốn bánh) A system that allows the engine to power all four wheels simultaneously, typically used for off-road or low-traction conditions.\n•\tFront-wheel drive (FWD): (Dẫn động cầu trước) A drivetrain configuration where the engine's power is transmitted to the front wheels.\n•\tRear-wheel drive (RWD): (Dẫn động cầu sau) A drivetrain configuration where the engine's power is transmitted to the rear wheels.\n•\tTorque: (Momen xoắn) The rotational force produced by the engine and transmitted through the drivetrain to propel the vehicle.",
                "functions": "Includes 3 types:\nPart-time 4WD\n\nPart-time 4-wheel drive system with 2 drive modes on different terrain types\nThe 4WD part-time drive system has a simple structure, so the price is often cheaper and easier to operate than other types of four-wheel drive. In addition, compared to full-time drive systems, vehicles using this drive system often consume less fuel.\nCurrent 4WD part-time drive systems usually have 3 basic axle engagement modes:\n•Mode 2H: high-speed single-wheel drive, suitable for driving on normal paved roads.\n•4H mode:  high-speed 2-wheel drive, helping the vehicle overcome roads with slippery surfaces.\n• Mode 4L: slow-speed 2-wheel drive, often activated when traveling through muddy, steep, and rough roads.\nThanks to these bridging modes, vehicles using a part-time 4-wheel drive system can provide good support to overcome bad terrain. In addition, drivers can also improve their driving skills and proactively choose appropriate modes when driving on different terrain conditions.\n4WD part-time drive systems are usually not equipped with a center differential. Therefore, when the bridge is engaged in 4H or 4L mode, the two bridges will be rigidly connected and distribute torque to each wheel equally, and the 4 wheels will rotate at the same speed. This causes disadvantages when the vehicle is cornering, so it is not recommended for use when the road surface is dry or too hard.\nHowever, many car manufacturers have overcome this drawback by adding the option of a center differential. With this option, the vehicle usually has 4 bridging modes: 2H, 4H, 4HLc and 4LLc.\nAll-wheel drive (AWD)\nThis car's drive system is full-time because there is no active single-wheel mode, the torque is distributed to all 4 wheels. This is the type of 4WD drive system with center differential so it will have many advantages.\nVehicles with a 4-wheel permanent drive system inherit the advantages of the 4WD system, being able to move in all terrain conditions without having to choose a mode like part-time drive. Therefore, the driver only needs to focus on driving.\nThe vehicle's drive system is equipped with a center differential, which can distribute torque to the front and rear wheels in a certain ratio. Many drive systems also have the ability to balance dynamics, transferring power back and forth between the front and rear axle depending on slippage or cornering speed. Thanks to that, the vehicle can move well on hard, dry road surfaces and with many curves without having hard wheels or damaging equipment.\n\nPermanent 4WD has the ability to balance the dynamics between the front and rear axle quite well\nBecause of its complex construction and the need for a lot of equipment, the price of regular 4-wheel drive is often higher than part-time 4-wheel drive. In addition, vehicles using this drive system often consume more fuel than other types when operating.\nFull-time 4WD\nWith the 4WD full-time drive system, torque will be automatically distributed to the axles to increase traction. The driver can set the \"Auto 4WD\" mode so that the vehicle automatically activates or deactivates 4WD drive mode depending on weather and terrain conditions.\nWith the ability to automatically distribute torque to the axles, the driver will be able to focus on driving, without requiring too much control skills.\nAutomatic torque distribution has many advantages, but it also creates barriers for drivers when encountering terrain that is too difficult because they cannot control themselves when overcoming obstacles.\nAll-wheel drive (AWD)\nAWD (All Wheel Drive) is a type of 4-wheel drive of a car in which power is continuously transmitted to all wheels.\n.\nAWD drive is equipped on many high-end SUVs or Sedan models\nAWD is considered one of the smartest car drive systems with high technology, possessing many advantages.\nAWD can automatically redistribute torque to the most suitable axles to increase traction in necessary situations. Because this drive system will automatically distribute power from the engine to the wheels according to an algorithm in the ECU.\nNormally, torque is distributed in a ratio of 5% to the front axle and 95% to the rear axle. When encountering difficult terrain, the drive system will automatically transfer energy from the rear axle to the front axle so that traction is at the best level.\nIn addition, thanks to the flexible distribution of torque to the wheels according to terrain conditions, the vehicle operates very balanced, providing a smooth driving experience. Because there is no auxiliary gear lever, controlling the car is quite easy.\nThe AWD drive system is designed to be quite compact, so the car's chassis does not need to be high, and the car's size will be optimal. Fuel consumption is also more economical than some other drive types.",
                "images": [
                    "https://firebasestorage.googleapis.com/v0/b/automotive-fe630.appspot.com/o/images%2F4067dd53-359d-4a0c-b7ba-cb61b01c4a07_zzxcas.png?alt=media&token=8d181aa6-e031-4ec5-99a0-717f0424c213"
                ]
            },
            "vi": {
                "name": "HỆ THỐNG DẪN ĐỘN",
                "content": "Hệ dẫn động 4 bánh ô tô là một hệ thống truyền tải năng lượng từ động cơ tới bánh xe giúp xe di chuyển. Việc trang bị hệ dẫn động phù hợp sẽ giúp động cơ hoạt động mạnh mẽ hơn. Tùy thuộc vào yêu cầu kỹ thuật, xe có thể được trang bị hệ thống dẫn động 1 cầu (2 bánh) hoặc 2 cầu (4 bánh). Trong bài viết này, chúng ta sẽ tìm hiểu chi tiết hơn về loại dẫn động bốn bánh.",
                "mainComponents": "1.Hệ thống truyền động: (Hệ thống dẫn động) Là bộ phận truyền công suất từ động cơ đến các bánh xe của ô tô.\n2.Động cơ: (Động cơ) Bộ phận của phương tiện tạo ra năng lượng bằng cách đốt cháy nhiên liệu.\n3.Bộ truyền động: (Hộp số) Là thiết bị truyền lực từ động cơ tới các bánh xe, cho phép xe thay đổi tốc độ và hướng chuyển động.\n4.Clutch: (Lá công) Một thiết bị đóng và ngắt hộp số khỏi động cơ để cho phép chuyển số.\n5.Differential: (Bộ chia tốc độ) Là thành phần cho phép các bánh xe quay với tốc độ khác nhau đồng thời cung cấp mô men xoắn bằng nhau.\n6.Trục: (Trục cầu) Trục mà bánh xe quay trên đó, thường là một phần của hệ thống truyền động.\n7.Hộp chuyển số: (Hộp đổi số) Là thiết bị phân phối lực từ hộp số tới cầu trước và cầu sau trên xe dẫn động bốn bánh.\n8.Trục dẫn động: (Trục dẫn động) Là trục quay truyền mô men xoắn từ động cơ tới bộ vi sai hoặc trục xe.\n9. Dẫn động bốn bánh (AWD): (Dẫn động bánh bánh) Một hệ thống truyền động truyền lực tới cả bốn bánh của xe để cải thiện độ bám đường và độ ổn định.\n10.Dẫn động bốn bánh (4WD): (Dẫn động bánh bánh) Một hệ thống cho phép động cơ cung cấp năng lượng đồng thời cho cả bốn bánh, thường được sử dụng trong điều kiện địa hình hoặc lực kéo thấp.\n11.Dẫn động cầu trước (FWD): (Dẫn động cầu trước) Cấu hình hệ thống truyền động trong đó sức mạnh của động cơ được truyền tới các bánh trước.\n12. Dẫn động cầu sau (RWD): (Dẫn động cầu sau) Cấu hình hệ thống truyền động trong đó sức mạnh của động cơ được truyền tới các bánh sau.\n13. Mô-men xoắn: (Momen xoắn) Lực quay do động cơ tạo ra và truyền qua hệ thống truyền lực để đẩy xe.",
                "functions": "\tDẫn động 4 bánh bán thời gian (Part-time 4WD)\n \nHệ dẫn động 4 bánh bán thời gian với 2 chế độ dẫn động trên các loại địa hình khác nhau\nHệ dẫn động bán thời gian 4WD có cấu tạo đơn giản nên giá thành thường rẻ hơn, dễ thao tác hơn so với các loại dẫn động bốn bánh khác. Ngoài ra, so với hệ dẫn động toàn thời gian thì xe sử dụng hệ dẫn động này thường ít tốn xăng hơn.\nHệ dẫn động bán thời gian 4WD hiện nay thường có 3 chế độ gài cầu cơ bản:\n•\tChế độ 2H: dẫn động 1 cầu tốc độ cao, phù hợp khi chạy trên đường trải nhựa bình thường. \n•\tChế độ 4H:  dẫn động 2 cầu tốc độ cao, giúp xe vượt qua các đoạn đường có bề mặt trơn trượt. \n•\tChế độ 4L: dẫn động 2 cầu tốc độ chậm, thường kích hoạt khi di chuyển qua các đoạn đường bùn lầy, dốc cao, gồ ghề. \nNhờ các chế độ gài cầu này, xe sử dụng hệ dẫn động 4 bánh bán thời gian có thể hỗ trợ tốt để vượt qua các địa hình xấu. Ngoài ra, tài xế cũng được nâng cao kỹ năng lái, chủ động chọn chế độ phù hợp khi lái trên những điều kiện địa hình khác nhau.\nHệ dẫn động bán thời gian 4WD thường không trang bị vi sai trung tâm. Vì vậy, khi gài cầu ở chế độ 4H hay 4L, hai cầu sẽ được nối cứng và phân phối mô-men xoắn đến từng bánh đều nhau, 4 bánh xe sẽ quay cùng tốc độ. Điều này gây bất lợi khi xe vào cua nên không được khuyến cáo sử dụng khi mặt đường khô hay quá cứng.\nTuy nhiên, nhiều hãng sản xuất xe hơi đã khắc phục nhược điểm này bằng cách đưa thêm tùy chọn vi sai trung tâm. Với tùy chọn này, xe thường có 4 chế độ gài cầu là 2H, 4H, 4HLc và 4LLc.\n\tDẫn động tất cả các bánh (AWD)\nHệ dẫn động ô tô này thuộc kiểu toàn thời gian vì không có chế độ 1 cầu chủ động, mô-men xoắn được phân bố tới cả 4 bánh. Đây chính là loại hệ dẫn động 4WD có vi sai trung tâm nên sẽ có khá nhiều ưu điểm.\nXe sở hữu hệ dẫn động thường xuyên 4 bánh được thừa hưởng những lợi thế của hệ 4WD, có thể di chuyển trong mọi điều kiện địa hình mà không cần chọn chế độ như loại dẫn động bán thời gian. Do đó, tài xế chỉ cần tập trung cho việc điều khiển.\nHệ dẫn động của xe được trang bị vi sai trung tâm, có thể phân phối mô-men xoắn đến bánh trước và bánh sau theo tỷ lệ nhất định. Nhiều hệ dẫn động còn có khả năng cân bằng động lực, truyền năng lượng qua lại giữa cầu trước và cầu sau tùy thuộc vào độ trượt hoặc tốc độ vào cua. Nhờ đó, xe có thể di chuyển tốt trong điều kiện mặt đường cứng và khô, nhiều khúc cua mà không bị bánh cứng hay làm hỏng thiết bị.\n \nPermanent 4WD có khả năng cân bằng động lực giữa cầu trước và cầu sau khá tốt\nBởi vì cấu tạo phức tạp và cần nhiều thiết bị nên giá của dẫn động 4 bánh thường xuyên cao hơn loại 4 bánh bán thời gian. Ngoài ra, loại xe sử dụng hệ dẫn động này thường hao xăng hơn so với các loại khác khi vận hành.\nDẫn động 4 bánh toàn thời gian (Full-time 4WD)\nVới hệ dẫn động toàn thời gian 4WD, mô-men xoắn sẽ được tự động phân phối đến các trục để tăng độ bám đường. Người lái có thể cài đặt chế độ “Auto 4WD” để xe tự kích hoạt hoặc ngừng kích hoạt chế độ dẫn động 4WD tùy theo điều kiện thời tiết, địa hình.\nVới khả năng tự động phân bổ mô-men xoắn đến các trục, tài xế sẽ có thể tập trung lái xe, không đòi hỏi quá cao về kỹ năng điều khiển. \nViệc tự động phân bổ mô-men xoắn có nhiều lợi thế nhưng cũng đem đến rào cản cho tài xế khi gặp phải địa hình quá hiểm trở vì không thể tự chủ được khi vượt chướng ngại vật.\n Dẫn động tất cả các bánh (AWD)\nAWD (All Wheel Drive) là loại dẫn động 4 bánh của xe ô tô mà năng lượng liên tục được truyền đến tất cả các bánh\n. \n Dẫn động AWD được trang bị trên nhiều mẫu xe SUV hoặc Sedan cao cấp\nAWD được đánh giá là một trong những hệ dẫn động ô tô thông minh nhất với công nghệ cao, sở hữu rất nhiều ưu điểm.\nAWD có thể tự động phân bổ lại mô-men xoắn đến các cầu phù hợp nhất để tăng độ bám đường trong tình huống cần thiết. Bởi vì hệ dẫn động này sẽ tự động phân phối năng lượng từ động cơ đến bánh xe theo một thuật toán ở trong ECU. \nThông thường, các mô-men xoắn thường được phân phối theo tỷ lệ là 5% tới cầu trước và 95% tới cầu sau. Khi gặp địa hình khó, hệ dẫn động sẽ tự động chuyển bớt năng lượng từ cầu sau tới cầu trước sao cho độ bám đường ở mức tốt nhất.\nNgoài ra, nhờ phân bổ mô-men xoắn đến các bánh linh hoạt theo điều kiện địa hình mà xe vận hành rất cân bằng, mang lại trải nghiệm lái mượt mà. Vì không có cần số phụ nên việc điều khiển xe khá dễ dàng.\nHệ dẫn động AWD được thiết kế khá nhỏ gọn nên gầm xe không cần thiết kế cao, kích thước xe sẽ được tối ưu nhất. Mức tiêu hao nhiên liệu cũng tiết kiệm hơn so với một số kiểu dẫn động khác.",
                "images": [
                    "https://firebasestorage.googleapis.com/v0/b/automotive-fe630.appspot.com/o/images%2F4067dd53-359d-4a0c-b7ba-cb61b01c4a07_zzxcas.png?alt=media&token=8d181aa6-e031-4ec5-99a0-717f0424c213"
                ]
            }
        },
        {
            "id": "2cd82363-d371-489d-bfba-a746a166ef20",
            "en": {
                "name": "Headlight System",
                "content": "The headlight system is an essential part of a vehicle, providing visibility for the driver during low light conditions, such as at night or in bad weather, and making the vehicle visible to other road users. Here is an overview of the main components and functions of a typical headlight system:",
                "mainComponents": "1.\tHeadlight Bulbs: Provide the light necessary for visibility. Common types include halogen, HID (High-Intensity Discharge), and LED (Light Emitting Diode).\n2.\tHeadlight Housing: Protects the headlight bulbs and helps direct the light beam.\n3.\tReflectors and Lenses: Reflectors focus and direct the light from the bulbs, while lenses help to shape the light beam and improve visibility.\n4.\tHeadlight Switch: Allows the driver to turn the headlights on and off and switch between high and low beams.\n5.\tHigh Beams: Provide a brighter and more focused light for use in low visibility situations where there is no oncoming traffic.\n6.\tLow Beams: Provide adequate illumination for driving without blinding oncoming traffic.\n7.\tDaytime Running Lights (DRL): Automatically turn on when the vehicle is running to increase visibility during the day.\n8.\tWiring and Relays: Connect the headlight components and control the power supply to the headlights.\n9.\tAutomatic Headlight Systems: Sensors and controls that automatically turn the headlights on or off based on ambient light conditions.",
                "functions": "1.\tIllumination: Provides adequate light for the driver to see the road and surroundings at night or in low light conditions.\n2.\tVisibility: Ensures that the vehicle is visible to other road users.\n3.\tBeam Switching: Allows the driver to switch between high beams for greater illumination and low beams to avoid blinding other drivers.\n4.\tAutomatic Operation: Uses sensors to automatically control the headlights based on ambient light conditions, enhancing convenience and safety.\n5.\tDaytime Visibility: Daytime running lights improve the vehicle's visibility during the day, reducing the risk of accidents.",
                "images": [
                    "https://firebasestorage.googleapis.com/v0/b/automotive-fe630.appspot.com/o/images%2F9fdef5a4-0105-46b4-a829-c9be38358b2f_qcsq.png?alt=media&token=6c8b2bcc-c4d2-42d7-a067-fb2cdfd45d4d"
                ]
            },
            "vi": {
                "name": "HỆ THỐNG ĐÈN PHA",
                "content": "Hệ thống đèn pha là một phần thiết yếu của xe, cung cấp tầm nhìn cho người lái xe trong điều kiện ánh sáng yếu, như ban đêm hoặc trong thời tiết xấu, và làm cho xe dễ thấy đối với những người tham gia giao thông khác. Dưới đây là tổng quan về các thành phần chính và chức năng của một hệ thống đèn pha điển hình:",
                "mainComponents": "1.\tBóng Đèn Pha: Cung cấp ánh sáng cần thiết cho tầm nhìn. Các loại thông thường bao gồm halogen, HID (High-Intensity Discharge), và LED (Light Emitting Diode).\n2.\tVỏ Đèn Pha: Bảo vệ bóng đèn pha và giúp định hướng chùm sáng.\n3.\tGương Phản Xạ và Thấu Kính: Gương phản xạ tập trung và hướng ánh sáng từ bóng đèn, trong khi thấu kính giúp định hình chùm sáng và cải thiện tầm nhìn.\n4.\tCông Tắc Đèn Pha: Cho phép người lái bật và tắt đèn pha cũng như chuyển đổi giữa chùm sáng cao và thấp.\n5.\tChùm Sáng Cao: Cung cấp ánh sáng sáng hơn và tập trung hơn cho tình huống tầm nhìn kém mà không có xe đối diện.\n6.\tChùm Sáng Thấp: Cung cấp đủ ánh sáng để lái xe mà không gây chói mắt cho người lái xe đối diện.\n7.\tĐèn Chạy Ban Ngày (DRL): Tự động bật khi xe chạy để tăng cường khả năng nhìn thấy trong ban ngày.\n8.\tDây Điện và Rơ-le: Kết nối các thành phần đèn pha và kiểm soát nguồn điện cho đèn pha.\n9.\tHệ Thống Đèn Pha Tự Động: Các cảm biến và điều khiển tự động bật hoặc tắt đèn pha dựa trên điều kiện ánh sáng môi trường.",
                "functions": "1.\tChiếu Sáng: Cung cấp đủ ánh sáng cho người lái xe để nhìn thấy đường và xung quanh vào ban đêm hoặc trong điều kiện ánh sáng yếu.\n2.\tKhả Năng Nhìn Thấy: Đảm bảo rằng xe có thể nhìn thấy được bởi những người tham gia giao thông khác.\n3.\tChuyển Đổi Chùm Sáng: Cho phép người lái chuyển đổi giữa chùm sáng cao để chiếu sáng mạnh hơn và chùm sáng thấp để tránh gây chói mắt cho các lái xe khác.\n4.\tHoạt Động Tự Động: Sử dụng cảm biến để tự động kiểm soát đèn pha dựa trên điều kiện ánh sáng môi trường, nâng cao tiện ích và an toàn.\n5.\tTầm Nhìn Ban Ngày: Đèn chạy ban ngày cải thiện khả năng nhìn thấy của xe trong ban ngày, giảm nguy cơ tai nạn.\n",
                "images": [
                    "https://firebasestorage.googleapis.com/v0/b/automotive-fe630.appspot.com/o/images%2F9fdef5a4-0105-46b4-a829-c9be38358b2f_qcsq.png?alt=media&token=6c8b2bcc-c4d2-42d7-a067-fb2cdfd45d4d"
                ]
            }
        },
        {
            "id": "ed2edbcd-c1aa-4f8f-ab55-87711fd7061a",
            "en": {
                "name": "DRIVE SYSTEM",
                "content": "",
                "mainComponents": "1.\tSteering wheel: (Vô lăng) A wheel that the driver uses to control the direction of the vehicle.\n2.\tSteering column: (Trục lái) The shaft that connects the steering wheel to the steering gear.\n3.\tSteering gear: (Hộp điều khiển lái) The mechanism that converts rotational motion from the steering wheel into lateral movement of the wheels.\n4.\tRack and pinion: (Rack và pinyon) A type of steering gear where a pinion gear meshes with a rack to convert rotational motion into linear motion.\n5.\tPower steering: (Lái điện) A system that assists steering effort by using hydraulic or electric actuators.\n6.\tSteering linkage: (Liên kết lái) Rods and joints that connect the steering gear to the wheels, transmitting steering motion.\n7.\tTie rod: (Thanh chống bánh) A rod that connects the steering gear to the steering knuckles, transmitting force to turn the wheels.\n8.\tSteering knuckle: (Khớp nối lái) The part of the steering system that connects the wheel and suspension to the steering linkage.\n9.\tPitman arm: (Cần gạt) A linkage component that converts the rotary motion of the steering gear into linear motion.\n10.\tIdler arm: (Cần gạt) A linkage component that supports the steering linkage.\n11.\tAlignment: (Cân bằng) The adjustment of suspension and steering components to ensure proper handling and tire wear.\n12.\tToe angle: (Góc giáp) The angle between the longitudinal axis of a wheel and the centerline of the vehicle, affecting tire wear and steering stability.\n13.\tCaster angle: (Góc mở cua) The angle between the steering axis and the vertical axis of a wheel, influencing steering stability and returnability.\n14.\tCamber angle: (Góc xuyên) The angle between the vertical axis of a wheel and its tilt inward or outward, affecting tire wear and handling.\n",
                "functions": "The suspension system plays an important role in the smooth, safe and stable operation of the car. This system includes parts such as springs, damper bars, stabilizer bars, joints,... connecting the vehicle frame to the wheels. The main functions of the suspension system include:\n\n1. Minimize vibration: When the vehicle moves on an uneven road, the wheels will encounter bumps and potholes, causing the vehicle to vibrate. The suspension system will absorb and eliminate these vibrations, providing a smooth and comfortable driving experience for people in the car.\n\n2. Maintain traction: The suspension system helps keep the wheels in best contact with the road surface, ensuring optimal traction, especially when cornering, braking suddenly or moving at high speed. Thanks to that, the vehicle can operate safely and stably.\n\n3. Support the vehicle's weight: The suspension system bears the vehicle's load, evenly distributing the weight to the wheels, helping the vehicle balance and move stably.\n\n4. Enhance control: The suspension system helps the vehicle respond quickly and accurately to the driver's controls, especially when cornering or moving on rough terrain.\n\nIn addition, the suspension system also has a number of other secondary functions such as:\n\nProtects other parts of the vehicle: The suspension system helps minimize the impact of vibrations on other parts of the vehicle, increasing the life of the vehicle.\nEnhance offroad capabilities: Some suspension systems are specially designed for offroad vehicles, helping the vehicle move easily on rough and dangerous terrain.\nPopular types of suspension systems:\nCurrently, there are 3 common types of suspension systems on cars:\n\n\tDependent suspension system: Uses springs and damper bars to minimize vibration. Advantages: simple structure, low production costs. Disadvantage: shock absorption is not as good as other types of suspension systems.\n\tIndependent suspension system: Each wheel has a separate suspension system, operating independently of each other. Advantages: good shock absorption ability, providing a smooth and comfortable driving experience. Disadvantages: complex structure, higher production costs.\nAir suspension system: Uses compressed air instead of springs to minimize vibration. Advantage: ability to adjust vehicle chassis height, suitable for many terrains. Disadvantages: complex structure, high production and maintenance costs.",
                "images": [
                    "https://firebasestorage.googleapis.com/v0/b/automotive-fe630.appspot.com/o/images%2Fe2808d7a-2cba-474a-a3e3-24596cd8791b_asscccwcww.png?alt=media&token=1da0ad4c-f405-4c27-b7ea-d0544c430355"
                ]
            },
            "vi": {
                "name": "HỆ THỐNG LÁI",
                "content": "",
                "mainComponents": "1.\t•Bánh lái: (Vô lăng) Là bánh xe được người lái dùng để điều khiển hướng đi của xe.\n2.\t•Trục lái: (Trục lái) Trục nối vô lăng với bánh lái.\n3.\t•Thiết bị lái: (Hộp điều khiển lái) Cơ cấu chuyển chuyển động quay từ vô lăng thành chuyển động ngang của các bánh xe.\n4.\t•Rack and bánh răng: (Rack và pinyon) Là loại cơ cấu lái trong đó bánh răng bánh răng ăn khớp với một thanh răng để biến chuyển động quay thành chuyển động thẳng.\n5.\t•Trợ lực lái: (Lái điện) Là hệ thống hỗ trợ lực lái bằng cách sử dụng bộ truyền động thủy lực hoặc điện.\n6.\t• Cơ cấu lái: (Liên kết lái) Các thanh và khớp nối bánh lái với các bánh xe, truyền chuyển động lái.\n7.\t•Thanh giằng: (Thanh chống bánh) Thanh nối bánh lái với các khớp tay lái, truyền lực làm quay bánh xe.\n8.\t•Tay lái: (Khớp nối lái) Là bộ phận của hệ thống lái kết nối bánh xe và hệ thống treo với cơ cấu lái.\n9.\t•Cần pitman: (Cần gạt) Là bộ phận liên kết chuyển chuyển động quay của cơ cấu lái thành chuyển động thẳng.\n10.\t•Tay lái không tải: (Cần gạt) Là bộ phận hỗ trợ liên kết lái.\n11.\t•Alignment: (Cân bằng) Việc điều chỉnh các bộ phận treo và lái để đảm bảo khả năng xử lý thích hợp và độ mòn của lốp.\n12.\t•Góc giáp: Góc giữa trục dọc bánh xe và đường tâm xe, ảnh hưởng đến độ mòn của lốp và ổn định lái.\n13.\t•Góc mở bánh xe: (Góc mở cua) Góc giữa trục lái và trục thẳng đứng của bánh xe, ảnh hưởng đến độ ổn định và khả năng quay trở lại của tay lái.\n14.\t•Góc khum: (Góc xuyên) Góc giữa trục thẳng đứng của bánh xe và độ nghiêng vào trong hoặc ra ngoài của bánh xe, ảnh hưởng đến độ mòn và khả năng xử lý của lốp.\n15.\tDẫn động lái: Bộ phận dẫn động lái bao gồm các chi tiết chính là vô lăng, trụ lái, các thanh dẫn động và khớp liên kết. Bộ phận này truyền chuyển động của tài xế đến hệ thống lái để thay đổi hướng di chuyển của xe, đồng thời tiếp nhận những phản ứng từ mặt đường tạo cảm giác lái chân thực cho tài xế.\n16.\tCơ cấu lái: Chức năng của cơ cấu lái là điều khiển các đòn xoay trong cơ cấu động học hình thang lái, đảm bảo bánh xe chuyển động theo đúng nguyên tắc Ackerman. Các nhà sản xuất ô tô thường sử dụng một trong hai dạng cơ cấu lái cơ bản là cơ cấu lái trục vít – thanh răng và cơ cấu lái loại bi tuần hoàn.\n17.\tTrợ lực lái: Trợ lực lái ô tô là cụm chi tiết phức tạp nhất trong hệ thống lái và thường xuyên được cải tiến để phù hợp với xu hướng phát triển ngành công nghiệp chế tạo ô tô. Trợ lực lái có nhiệm vụ giảm lực quay vô lăng khi cần thiết nhằm hỗ trợ tài xế đánh lái dễ dàng. Hệ thống trợ lực lái khá phát triển nhưng phổ biến nhất hiện nay là trợ lực lái thủy lực và trợ lực lái điện. Trong đó, hệ thống trợ lực lái điện đang ngày càng chứng minh được tính ưu việt so với các loại trợ lực khác.",
                "functions": "Hệ thống treo đóng vai trò quan trọng trong việc vận hành êm ái, an toàn v�� ổn định của ô tô. Hệ thống này bao gồm các bộ phận như: lò xo, thanh giảm chấn, thanh ổn định, khớp nối,... kết nối khung xe với các bánh xe. Chức năng chính của hệ thống treo bao gồm:\n1. Giảm thiểu rung lắc: Khi xe di chuyển trên đường không bằng phẳng, bánh xe sẽ gặp phải các gờ, ổ gà, khiến xe bị rung lắc. Hệ thống treo sẽ hấp thụ và triệt tiêu các rung lắc này, mang lại cảm giác lái êm ái và thoải mái cho người ngồi trong xe.\n2. Duy trì độ bám đường: Hệ thống treo giúp giữ cho bánh xe luôn tiếp xúc tốt nhất với mặt đường, đảm bảo độ bám đường tối ưu, đặc biệt khi vào cua, phanh gấp hoặc di chuyển với tốc độ cao. Nhờ vậy, xe có thể vận hành an toàn và ổn định.\n3. Nâng đỡ trọng lượng xe: Hệ thống treo chịu tải trọng của xe, phân bổ đều trọng lượng lên các bánh xe, giúp xe cân bằng và di chuyển ổn định.\n4. Tăng cường khả năng điều khiển: Hệ thống treo giúp xe phản ứng nhanh và chính xác với thao tác điều khiển của người lái, đặc biệt khi vào cua hoặc di chuyển trên địa hình gồ ghề.\nNgoài ra, hệ thống treo còn có một số chức năng phụ khác như:\n•\tBảo vệ các bộ phận khác của xe: Hệ thống treo giúp giảm thiểu tác động của lực rung lắc lên các bộ phận khác của xe, tăng tuổi thọ cho xe.\n•\tTăng cường khả năng offroad: Một số hệ thống treo được thiết kế đặc biệt cho xe offroad, giúp xe di chuyển dễ dàng trên địa hình gồ ghề, hiểm trở.\nCác loại hệ thống treo phổ biến:\nHiện nay, có 3 loại hệ thống treo phổ biến trên ô tô:\n1.\tHệ thống treo phụ thuộc: Sử dụng lò xo và thanh giảm chấn để giảm thiểu rung lắc. Ưu điểm: cấu tạo đơn giản, chi phí sản xuất thấp. Nhược điểm: khả năng giảm xóc không tốt bằng các loại hệ thống treo khác.\n2.\tHệ thống treo độc lập: Mỗi bánh xe có hệ thống treo riêng biệt, hoạt động độc lập với nhau. Ưu điểm: khả năng giảm xóc tốt, mang lại cảm giác lái êm ái và thoải mái. Nhược điểm: cấu tạo phức tạp, chi phí sản xuất cao hơn.\n3.\tHệ thống treo khí nén: Sử dụng khí nén thay cho lò xo để giảm thiểu rung lắc. Ưu điểm: khả năng điều chỉnh độ cao gầm xe, phù hợp với nhiều địa hình. Nhược điểm: cấu tạo phức tạp, chi phí sản xuất và bảo dưỡng cao.",
                "images": [
                    "https://firebasestorage.googleapis.com/v0/b/automotive-fe630.appspot.com/o/images%2Fe2808d7a-2cba-474a-a3e3-24596cd8791b_asscccwcww.png?alt=media&token=1da0ad4c-f405-4c27-b7ea-d0544c430355"
                ]
            }
        },
        {
            "id": "c6e8f25e-7c9e-41d4-b367-72c2752bc2d1",
            "en": {
                "name": "car wheel system",
                "content": "",
                "mainComponents": "1.\tWheel: The part of a vehicle that is directly attached to the axle and used to move the vehicle on the road.\n2.\tTire: A rubber layer surrounding the wheel, which absorbs shocks and provides traction.\n3.\tRim: The frame part that holds the tire and connects directly to the axle.\n4.\tBraking system: Components used to control and stop the vehicle, including disc brakes or drum brakes.\n5.\tAxle: A shaft that supports the weight of the vehicle and transmits power from the gearbox to the wheels.\n6.\tSuspension system: Includes springs, shock absorbers, and other components to absorb and dampen shocks from the road.\n7.\tWheel alignment: The process of adjusting the wheels to ensure stability and safe handling while driving.",
                "functions": "The wheel system plays an important role in the safe and efficient operation of the car. This system includes main parts such as: rims, tires, wheel axles, brake system, steering system,... and operates according to the following principles:\n\n1. Bearing the load: The wheel system bears the entire weight of the vehicle, including the weight of the driver, passengers and cargo. The components in the wheel system are designed to withstand large loads and operate durably.\n\n2. Power transmission: The wheel system transmits power from the engine to the road surface, helping the vehicle move. Tires play an important role in transmitting this force, helping the vehicle grip the road and move safely.\n\n3. Change the direction of movement: The wheel system, especially the steering system, allows the driver to control the direction of the vehicle's movement. When the driver steers, the steering system will transmit signals to the wheel system, causing the wheels to rotate in the desired direction.\n\n4. Minimize vibration: The wheel system, especially the suspension system, helps minimize vibration from the road surface to the vehicle, bringing a smooth and comfortable driving experience to the occupants.\n\n5. Vehicle brakes: The brake system in the wheel system helps slow down and stop the vehicle safely. When the driver steps on the brake, the brake system will create friction to reduce the speed of the wheels, helping the vehicle stop safely.\n\nIn addition, the wheel system also has a number of other secondary functions such as:\n\n1.\tAesthetics: The wheel system contributes to the vehicle's exterior beauty.\n2.\tEnhance offroad capabilities: Some wheel systems are specially designed for offroad vehicles, helping the vehicle move easily on rough and dangerous terrain.\n3.\tMain parts of the wheel system:\n4.\tRim: A rim is a circular metal part that is installed on the wheel hub and serves as a support for the tire. Car rims come in many different sizes and designs, contributing to the vehicle's exterior beauty.\n5.\tTires: Tires are rubber parts installed on the rim of the car, in direct contact with the road surface. Tires play an important role in transmitting power, gripping the road and minimizing vibration.\n6.\tWheel axle: The wheel axle is the metal part that connects the wheel to the vehicle frame. The wheel axle helps transmit power from the engine to the wheels and vice versa.\n7.\tBrake system: The brake system includes parts such as brake pads, brake discs, brake pumps, etc. to help slow down and stop the vehicle safely.\n8.\tSteering system: The steering system includes steering wheel, steering shaft, steering rod, steering joint,... helps the driver control the direction of the vehicle's movement. \n",
                "images": [
                    "https://firebasestorage.googleapis.com/v0/b/automotive-fe630.appspot.com/o/images%2F656b0fbf-dae2-4128-aa5c-7befc1308bf2_dw1d1.png?alt=media&token=0377770f-fe3a-4d22-a1f6-354325ea3253"
                ]
            },
            "vi": {
                "name": "HỆ THỐNG BÁNH XE",
                "content": "",
                "mainComponents": "1.\tBánh xe: Phần của xe được gắn trực tiếp vào trục và được sử dụng để di chuyển xe trên mặt đường.\n2.\tLốp xe: Lớp cao su bọc quanh bánh xe, giúp giảm sóc và cung cấp bám đường.\n3.\tVành xe: Phần khung chứa lốp xe và kết nối trực tiếp với trục.\n4.\tHệ thống phanh: Các bộ phận để kiểm soát và ngừng lại xe, bao gồm bộ phận phanh đĩa hoặc phanh tang trống.\n5.\tTrục xe: Trục chịu trọng lượng của xe và truyền động từ hộp số tới bánh xe.\n6.\tHệ thống treo: Bao gồm lò xo, giảm xóc và các bộ phận khác để hấp thụ và giảm sóc từ mặt đường.\n7.\tCân bằng lốp: Quá trình điều chỉnh các lốp xe để đảm bảo sự ổn định và an toàn khi lái xe.\n",
                "functions": "Hệ thống bánh xe đóng vai trò quan trọng trong việc vận hành an toàn và hiệu quả của ô tô. Hệ thống này bao gồm các bộ phận chính như: vành xe, lốp xe, trục bánh xe, hệ thống phanh, hệ thống lái,... và hoạt động theo nguyên tắc sau:\n\n1. Chịu tải trọng: Hệ thống bánh xe chịu toàn bộ trọng lượng của xe, bao gồm cả trọng lượng của người lái, hành khách và hàng hóa. Các bộ phận trong hệ thống bánh xe được thiết kế để chịu được tải trọng lớn và hoạt động bền bỉ.\n\n2. Truyền lực: Hệ thống bánh xe truyền lực từ động cơ đến mặt đường, giúp xe di chuyển. Lốp xe có vai trò quan trọng trong việc truyền lực này, giúp xe bám đường và di chuyển an toàn.\n\n3. Thay đổi hướng di chuyển: Hệ thống bánh xe, đặc biệt là hệ thống lái, cho phép người lái điều khiển hướng di chuyển của xe. Khi người lái đánh lái, hệ thống lái sẽ truyền tín hiệu đến hệ thống bánh xe, khiến các bánh xe quay theo hướng mong muốn.\n\n4. Giảm thiểu rung lắc: Hệ thống bánh xe, đặc biệt là hệ thống treo, giúp giảm thiểu rung lắc từ mặt đường truyền lên xe, mang lại cảm giác lái êm ái và thoải mái cho người ngồi trong xe.\n\n5. Phanh xe: Hệ thống phanh trong hệ thống bánh xe giúp giảm tốc độ và dừng xe an toàn. Khi người lái đạp phanh, hệ thống phanh sẽ tạo ra lực ma sát để giảm tốc độ của bánh xe, giúp xe dừng lại an toàn.\n\nNgoài ra, hệ thống bánh xe còn có một số chức năng phụ khác như:\n\nHệ thống bánh xe góp phần tạo nên vẻ đẹp ngoại thất của xe.\nTăng cường khả năng offroad: Một số hệ thống bánh xe được thiết kế đặc biệt cho xe offroad, giúp xe di chuyển dễ dàng trên địa hình gồ ghề, hiểm trở.\nCác bộ phận chính của hệ thống bánh xe:\n1.\tVành xe: Vành xe là bộ phận kim loại hình tròn, được lắp vào trục bánh xe và là giá đỡ cho lốp xe. Vành xe có nhiều kích cỡ và kiểu dáng khác nhau, góp phần tạo nên vẻ đẹp ngoại thất của xe.\n2.\tLốp xe: Lốp xe là bộ phận cao su được lắp vào vành xe, tiếp xúc trực tiếp với mặt đường. Lốp xe có vai trò quan trọng trong việc truyền lực, bám đường và giảm thiểu rung lắc.\n3.\tTrục bánh xe: Trục bánh xe là bộ phận kim loại nối bánh xe với khung xe. Trục bánh xe giúp truyền lực từ động cơ đến bánh xe và ngược lại.\n4.\tHệ thống phanh: Hệ thống phanh bao gồm các bộ phận như má phanh, đĩa phanh, bơm phanh,... giúp giảm tốc độ và dừng xe an toàn.\n5.\tHệ thống lái: Hệ thống lái bao gồm vô lăng, trục lái, thanh lái, khớp lái,... giúp người lái điều khiển hướng di chuyển của xe.",
                "images": [
                    "https://firebasestorage.googleapis.com/v0/b/automotive-fe630.appspot.com/o/images%2F656b0fbf-dae2-4128-aa5c-7befc1308bf2_dw1d1.png?alt=media&token=0377770f-fe3a-4d22-a1f6-354325ea3253"
                ]
            }
        },
        {
            "id": "16807304-c1de-418d-97fa-0e77e4aabd82",
            "en": {
                "name": "Electrical System",
                "content": "",
                "mainComponents": "1.\tElectrical system: Includes the electronic and electrical components of a vehicle that provide power to various devices and functions.\n2.\tBattery: A device that stores electrical energy to power the starting system and other electronic devices of the vehicle.\n3.\tIgnition system: A device that generates electrical sparks to ignite fuel in an internal combustion engine.\n4.\tElectrical circuit: The system of electrical wires and connectors that transmit electricity from the battery to other devices in the vehicle.\n5.\tElectrical sensors: Devices used to measure parameters such as temperature, pressure, engine RPM, to control the system and provide information to the driver.\n6.\tLighting system: Includes headlights, tail lights, and other lighting components for illumination and signaling.\n7.\tControl system: Microprocessors and controllers that manage the electronic system and other functions in the vehicle.\n",
                "functions": "1.\tStarting the engine: When the driver starts the vehicle, the battery will provide electricity to the starter motor to rotate the crankshaft, thereby starting the engine.\n2.\tSupplying power to other systems: The electrical system supplies power to all other systems on the vehicle, including lighting systems, entertainment systems, air conditioning systems, power window systems, and power systems. central door locking system,...\n3.\tStarting support: Some electrical systems have a starting support function when the battery is low, making it easier to start the vehicle.\n4.\tAnti-theft: The electrical system can integrate an anti-theft system, helping to protect the vehicle from being stolen by thieves.\n5.\tProviding information: The electrical system provides information to the driver about the vehicle's operating status through indicator lights and display screens.\nIn addition, the car's electrical system also has a number of other functions such as:\n\n\tMinimize emissions: The electrical system helps reduce emissions into the environment by controlling the engine to operate more efficiently.\n\tEnhanced safety: The electrical system helps enhance vehicle safety by providing features such as ABS braking system, electronic stability control system (ESP),...\n\tEnhance comfort: The electrical system helps improve vehicle comfort by providing features such as automatic air conditioning system, seat heating system,...",
                "images": [
                    "https://firebasestorage.googleapis.com/v0/b/automotive-fe630.appspot.com/o/images%2Fdbf836fc-e024-4bf8-806e-7a2f36e09a7a_ascas.png?alt=media&token=56fcb064-1256-41b9-a11e-2919c4e7189b"
                ]
            },
            "vi": {
                "name": "HỆ THỐNG ĐIỆN",
                "content": "",
                "mainComponents": "1.\tHệ thống điện: Bao gồm các thành phần điện tử và điện cơ của xe để cung cấp điện cho các thiết bị và chức năng khác nhau.\n2.\tẮc quy: Thiết bị lưu trữ năng lượng điện để cấp điện cho hệ thống khởi động và các thiết bị điện tử khác của xe.\n3.\tBộ đánh lửa: Thiết bị tạo ra điện xung để kích hoạt nổ trong động cơ đốt trong.\n4.\tMạch điện: Hệ thống dây dẫn điện và bộ nối để truyền dẫn điện từ ắc quy đến các thiết bị khác trên xe.\n5.\tCảm biến điện: Thiết bị để đo lường các thông số như nhiệt độ, áp suất, vòng tua động cơ, để điều khiển hệ thống và cung cấp thông tin cho người lái.\n6.\tHệ thống đèn chiếu sáng: Bao gồm các đèn pha, đèn hậu và các đèn chiếu sáng khác để chiếu sáng và cung cấp tín hiệu cho xe.\n7.\tHệ thống điều khiển: Các bộ vi xử lý và điều khiển để quản lý hệ thống điện tử và các chức năng khác trên xe.\n",
                "functions": "1.\tKhởi động động cơ: Khi người lái khởi động xe, ắc quy sẽ cung cấp điện cho động cơ khởi động để quay trục khuỷu, từ đó khởi động động cơ.\n2.\tCung cấp điện cho các hệ thống khác: Hệ thống điện cung cấp điện cho tất cả các hệ thống khác trên xe, bao gồm hệ thống đèn, hệ thống giải trí, hệ thống điều hòa không khí, hệ thống cửa sổ điện, hệ thống khóa cửa trung tâm,...\n3.\tHỗ trợ khởi động: Một số hệ thống điện có chức năng hỗ trợ khởi động khi ắc quy yếu, giúp xe khởi động dễ dàng hơn.\n4.\tChống trộm: Hệ thống điện có thể tích hợp hệ thống chống trộm, giúp bảo vệ xe khỏi bị kẻ gian đánh cắp.\n5.\tCung cấp thông tin: Hệ thống điện cung cấp thông tin cho người lái về tình trạng hoạt động của xe thông qua các đèn báo và màn hình hiển thị.\nNgoài ra, hệ thống điện trên ô tô còn có một số chức năng khác như:\n•\tGiảm thiểu khí thải: Hệ thống điện giúp giảm thiểu khí thải ra môi trường bằng cách điều khiển động cơ hoạt động hiệu quả hơn.\n•\tTăng cường an toàn: Hệ thống điện giúp tăng cường an toàn cho xe bằng cách cung cấp các tính năng như hệ thống phanh ABS, hệ thống cân bằng điện tử (ESP),...\n•\tNâng cao tiện nghi: Hệ thống điện giúp nâng cao tiện nghi cho xe bằng cách cung cấp các tính năng như hệ thống điều hòa tự động, hệ thống sưởi ấm ghế,...\n",
                "images": [
                    "https://firebasestorage.googleapis.com/v0/b/automotive-fe630.appspot.com/o/images%2Fdbf836fc-e024-4bf8-806e-7a2f36e09a7a_ascas.png?alt=media&token=56fcb064-1256-41b9-a11e-2919c4e7189b"
                ]
            }
        },
        {
            "id": "6519cd95-ba02-4ce7-bf19-5efd4722fb22",
            "en": {
                "name": "Air Conditioning System",
                "content": "",
                "mainComponents": "1.\tAir conditioning system: Includes devices and components to regulate the temperature and humidity of air inside the vehicle.\n2.\tCompressor: A device that compresses refrigerant (usually gas) to produce cold air.\n3.\tHeat exchanger: A device to exchange heat between cold air and hot air inside the vehicle.\n4.\tController: A microprocessor and sensors to control the temperature and other functions of the air conditioning system.\n5.\tVentilation fan: A device to circulate and distribute cold air to different positions inside the vehicle.\n6.\tAir filter: A filter to remove dust and other small particles from the air, improving air quality inside the vehicle.\n7.\tAutomatic control system: A system capable of automatically adjusting temperature and airflow according to environmental conditions and driver settings.\nThe air conditioning system (also known as the cooling system) in a car plays an important role in providing comfort and convenience to the driver and passengers, especially in hot weather conditions. This system operates on the principle of cooling, filtering and dehumidifying the air inside the vehicle, helping to create a pleasant environment and ensure the health of the user.",
                "functions": "1.\tAir cooling: This is the main function of the air conditioning system, helping to reduce the temperature in the car to the desired temperature level, bringing a cool and comfortable feeling to the car occupants.\n2.\tClean air: The air conditioning system is equipped with an air filter that helps remove dust, pollen, bacteria and other pollutants in the air, providing fresh and healthy air.\n3.\tDehumidification: The air conditioning system helps reduce humidity in the air, especially in humid climates, helping to prevent mold and bacteria from growing, while creating a more comfortable feeling for the user. use.\n4.\tEliminate odors: The air conditioning system can be equipped with an activated carbon filter that helps eliminate odors, cigarette odors and other unpleasant odors in the car.\n5.\tProviding ventilation: The air conditioning system helps circulate air in the car, removing CO2 and other toxic substances, ensuring the health of the user.\nThe car air conditioning system includes the following main parts:\n\n\tCompressor: The compressor is responsible for compressing the refrigerant (usually freon gas) at high pressure.\n\tOutdoor unit: The outdoor unit is where the refrigerant cools after being compressed by the compressor.\n\tIndoor unit: The indoor unit is the place that absorbs heat from the air in the car to cool the refrigerant.\n\tFan: The fan is responsible for circulating air in the car through the indoor and outdoor units.\n\tController: The controller is responsible for adjusting the operation of the air conditioning system, including adjusting temperature, humidity, fan speed,...\nThere are many different types of car air conditioning systems, the most popular are:\n\n\tAutomatic air conditioning system: This type of system is equipped with temperature and humidity sensors, automatically adjusting the temperature and humidity in the car according to the user's settings.\n\tManual air conditioning system: This type of system allows users to adjust temperature, humidity and fan speed manually.\nChoosing the right air conditioning system depends on many factors such as:\n\n\tVehicle type: Vehicle size and type affect the required air conditioning system capacity.\n\tLevel of use: The level of use of the air conditioning system also affects the selection of the appropriate system type.\n\tBudget: The cost of air conditioning systems varies, so you need to consider your budget to choose the right system.\n\tFeatures: Some air conditioning systems are equipped with advanced features such as air filtration, deodorization, energy saving, etc. You need to consider your needs to choose the appropriate system.\nNotes when using the car air conditioning system:\n\n\tPeriodic system maintenance: It is necessary to periodically maintain the air conditioning system according to the manufacturer's recommendations to ensure efficient operation and energy savings.\n\tClean the system regularly: Clean the air conditioning system regularly to remove dirt, bacteria and mold.\n\tUse the system appropriately: Avoid using the air conditioning system excessively, adjust the temperature appropriately to save energy and protect health.\n\tCheck gas periodically: Gas is the refrigerant of the air conditioning system, it needs to be checked and supplemented periodically according to the manufacturer's recommendations.",
                "images": [
                    "https://firebasestorage.googleapis.com/v0/b/automotive-fe630.appspot.com/o/images%2F168ef560-421d-4ee1-ad30-c06eb5bb37fc_sdqqsdqccs.png?alt=media&token=5262bb82-3962-403b-9dfa-75e73312d2f6"
                ]
            },
            "vi": {
                "name": "HỆ THỐNG ĐIỀU HÒA",
                "content": "",
                "mainComponents": "1.\tHệ thống điều hòa không khí: Bao gồm các thiết bị và linh kiện để điều hòa nhiệt độ và độ ẩm của không khí trong xe.\n2.\tMáy nén: Thiết bị nén chất làm lạnh (thường là gas) để tạo ra không khí lạnh.\n3.\tBộ trao đổi nhiệt: Thiết bị để trao đổi nhiệt giữa không khí lạnh và không khí nóng trong xe.\n4.\tBộ điều khiển: Bộ vi xử lý và các cảm biến để điều khiển nhiệt độ và các chức năng khác của hệ thống điều hòa.\n5.\tQuạt thông gió: Thiết bị để tuần hoàn và phân phối không khí lạnh đến các vị trí khác nhau trong xe.\n6.\tLọc không khí: Bộ lọc để loại bỏ bụi và các hạt nhỏ khác từ không khí, cải thiện chất lượng không khí bên trong xe.\n7.\tHệ thống điều khiển tự động: Hệ thống có khả năng tự động điều chỉnh nhiệt độ và lưu lượng không khí theo các điều kiện môi trường và sự cài đặt của người lái.\nHệ thống điều hòa (hay còn gọi là hệ thống làm mát) trên ô tô đóng vai trò quan trọng trong việc mang lại sự thoải mái và tiện nghi cho người lái và hành khách, đặc biệt là trong điều kiện thời tiết nóng bức. Hệ thống này hoạt động theo nguyên tắc làm mát, lọc sạch và khử ẩm không khí bên trong xe, giúp tạo ra môi trường dễ chịu và đảm bảo sức khỏe cho người sử dụng.\n",
                "functions": "1.\tLàm mát không khí: Đây là chức năng chính của hệ thống điều hòa, giúp giảm nhiệt độ trong xe xuống mức nhiệt độ mong muốn, mang lại cảm giác mát mẻ và thoải mái cho người ngồi trong xe.\n2.\tLọc sạch không khí: Hệ thống điều hòa được trang bị bộ lọc không khí giúp loại bỏ bụi bẩn, phấn hoa, vi khuẩn và các chất ô nhiễm khác trong không khí, mang lại bầu không khí trong lành và tốt cho sức khỏe.\n3.\tKhử ẩm: Hệ thống điều hòa giúp giảm độ ẩm trong không khí, đặc biệt là trong những khu vực có khí hậu ẩm ướt, giúp ngăn ngừa nấm mốc và vi khuẩn phát triển, đồng thời tạo cảm giác dễ chịu hơn cho người sử dụng.\n4.\tLoại bỏ mùi hôi: Hệ thống điều hòa có thể được trang bị bộ lọc than hoạt tính giúp loại bỏ mùi hôi, mùi thuốc lá và các mùi khó chịu khác trong xe.\n5.\tCung cấp thông gió: Hệ thống điều hòa giúp lưu thông không khí trong xe, loại bỏ khí CO2 và các chất độc hại khác, đảm bảo sức khỏe cho người sử dụng.\nHệ thống điều hòa trên ô tô bao gồm các bộ phận chính sau:\n•\tMáy nén: Máy nén có nhiệm vụ nén môi chất lạnh (thường là khí freon) ở áp suất cao.\n•\tDàn nóng: Dàn nóng là nơi làm mát môi chất lạnh sau khi được nén bởi máy nén.\n•\tDàn lạnh: Dàn lạnh là nơi hấp thụ nhiệt từ không khí trong xe để làm mát môi chất lạnh.\n•\tQuạt gió: Quạt gió có nhiệm vụ lưu thông không khí trong xe qua dàn lạnh và dàn nóng.\n•\tBộ điều khiển: Bộ điều khiển có nhiệm vụ điều chỉnh hoạt động của hệ thống điều hòa, bao gồm điều chỉnh nhiệt độ, độ ẩm, tốc độ quạt gió,...\nHệ thống điều hòa trên ô tô có nhiều loại khác nhau, phổ biến nhất là:\n•\tHệ thống điều hòa tự động: Loại hệ thống này được trang bị cảm biến nhiệt độ và độ ẩm, tự động điều chỉnh nhiệt độ và độ ẩm trong xe theo cài đặt của người sử dụng.\n•\tHệ thống điều hòa chỉnh tay: Loại hệ thống này cho phép người sử dụng điều chỉnh nhiệt độ, độ ẩm và tốc độ quạt gió bằng tay.\nLựa chọn hệ thống điều hòa phù hợp phụ thuộc vào nhiều yếu tố như:\n•\tLoại xe: Kích thước và loại xe ảnh hưởng đến công suất hệ thống điều hòa cần thiết.\n•\tMức độ sử dụng: Mức độ sử dụng hệ thống điều hòa cũng ảnh hưởng đến việc lựa chọn loại hệ thống phù hợp.\n•\tNgân sách: Giá thành của các hệ thống điều hòa khác nhau, do đó cần cân nhắc ngân sách để lựa chọn hệ thống phù hợp.\n•\tTính năng: Một số hệ thống điều hòa được trang bị các tính năng tiên tiến như lọc không khí, khử mùi, tiết kiệm năng lượng,... cần cân nhắc nhu cầu sử dụng để lựa chọn hệ thống phù hợp.\nLưu ý khi sử dụng hệ thống điều hòa trên ô tô:\n•\tBảo dưỡng hệ thống định kỳ: Cần bảo dưỡng hệ thống điều hòa định kỳ theo khuyến cáo của nhà sản xuất để đảm bảo hoạt động hiệu quả và tiết kiệm năng lượng.\n•\tVệ sinh hệ thống thường xuyên: Vệ sinh hệ thống điều hòa thường xuyên để loại bỏ bụi bẩn, vi khuẩn và nấm mốc.\n•\tSử dụng hệ thống hợp lý: Tránh sử dụng hệ thống điều hòa quá mức, điều chỉnh nhiệt độ phù hợp để tiết kiệm năng lượng và bảo vệ sức khỏe.\n•\tKiểm tra gas định kỳ: Gas là môi chất làm lạnh của hệ thống điều hòa, cần kiểm tra và bổ sung gas định kỳ theo khuyến cáo của nhà sản xuất.",
                "images": [
                    "https://firebasestorage.googleapis.com/v0/b/automotive-fe630.appspot.com/o/images%2F168ef560-421d-4ee1-ad30-c06eb5bb37fc_sdqqsdqccs.png?alt=media&token=5262bb82-3962-403b-9dfa-75e73312d2f6"
                ]
            }
        },
        {
            "id": "92db648d-f43a-4377-a961-4f04db8949e4",
            "en": {
                "name": "Exterior",
                "content": "",
                "mainComponents": "1.\tBody: The outer shell of the vehicle, including doors, windows, and the main structure.\n2.\tFront end: The front part of the vehicle, including the hood, grille, and headlights.\n3.\tRear end: The rear part of the vehicle, including the trunk, taillights, and side panels.\n4.\tDoors and windows: Openings for entering and exiting the vehicle, and windows for ventilation.\n5.\tMirrors: Devices used to see behind and alongside the vehicle while driving.\n6.\tLights: Includes headlights, taillights, turn signals, and other illumination.\n7.\tExhaust system: The system through which engine gases are expelled, sometimes designed to enhance sound or performance.\n8.\tExterior design: The overall style and shape of the vehicle, including lines, colors, and design details.\n",
                "functions": "The car's exterior plays an important role, directly affecting the vehicle's aesthetics, aerodynamics, performance and safety. Main exterior parts include:\n\n1. Vehicle tires:\n\nProtection: The car cover is a metal shell that covers the entire car frame, protecting the internal parts from environmental impacts such as rain, sun, dirt, impact,...\nAesthetics: Vehicle tires contribute to the beautiful appearance of the vehicle, expressing the user's personality and preferences.\nAerodynamics: The aerodynamic design of the vehicle's tires helps minimize wind resistance, save fuel and increase speed.\n2. Car door:\n\nConvenience: Car doors help the driver and passengers get in and out of the car easily.\nProtection: Car doors play the role of protecting people inside the car from external impacts such as impact, noise,...\nSafety: Car doors are equipped with safety systems such as automatic door locks, anti-jamming windows,...\n3. Car glass:\n\nObservation: Vehicle glass helps the driver observe the front, sides and rear of the vehicle, ensuring safety when driving.\nProtection: Car glass protects people in the car from dust, insects, UV rays,...\nAesthetics: Car glass contributes to the beautiful appearance of the car.\n4. Vehicle lights:\n\nLighting: Car lights help the driver see the road and other vehicles in low light or dark conditions.\nSignaling: Vehicle lights help signal other vehicles about the vehicle's presence, ensuring safety when participating in traffic.\nAesthetics: Car lights contribute to the beautiful appearance of the car.\n5. Car mirrors:\n\nObservation: Car mirrors help the driver observe vehicles behind and on both sides of the vehicle, ensuring safety when changing lanes, reversing,...\nAesthetics: Car mirrors contribute to the car's beautiful appearance.\n6. Bumper:\n\nProtection: Vehicle bumpers help reduce impact force during a collision, protecting important vehicle parts such as engine, gearbox,...\nAesthetics: Bumpers contribute to the beautiful appearance of the vehicle.\n7. Tires:\n\nContact: Tires are the only parts in direct contact with the road surface, helping the vehicle move.\nShock absorption: Tires help absorb shock from the road surface, providing a smooth and comfortable driving experience.\nPower transmission: Tires transmit power from the engine to the road surface, helping the vehicle move.\n8. Other parts:\n\nIn addition, the car's exterior also includes other parts such as antennas, roof racks, car logos,... each part has its own function that contributes to the completeness of the car.",
                "images": [
                    "https://firebasestorage.googleapis.com/v0/b/automotive-fe630.appspot.com/o/images%2F9708b9c0-75fc-46c5-9750-77b4912e03b9_ascas.png?alt=media&token=6a927c80-dabd-4b16-a156-212337fbb1ba"
                ]
            },
            "vi": {
                "name": "Ngoại thất ô tô ",
                "content": "",
                "mainComponents": "1.\tThân xe: Phần bao bọc bên ngoài của xe, bao gồm cả cửa, cửa sổ và thân xe.\n2.\tMặt trước: Phần phía trước của xe, bao gồm đầu xe, lưới tản nhiệt và đèn pha.\n3.\tMặt sau: Phần phía sau của xe, bao gồm đuôi xe, đèn hậu và ốp sườn.\n4.\tCửa và cửa sổ: Phần mở ra để lên xuống xe và các cửa sổ có thể được mở để thông gió.\n5.\tGương chiếu hậu: Các gương dùng để nhìn lại phía sau và cạnh xe khi lái xe.\n6.\tĐèn xe: Bao gồm các đèn pha, đèn hậu, đèn xi nhan và các đèn chiếu sáng khác.\n7.\tPô xe: Hệ thống thoát khí từ động cơ, có thể được thiết kế để tăng âm thanh hoặc hiệu suất.\n8.\tThiết kế ngoại thất: Phong cách và hình dáng tổng thể của xe, bao gồm các đường nét, màu sắc và các chi tiết thiết kế.\n",
                "functions": "Ngoại thất ô tô đóng vai trò quan trọng, ảnh hưởng trực tiếp đến thẩm mỹ, tính khí động học, khả năng vận hành và an toàn của xe. Các bộ phận ngoại thất chính bao gồm:\n1. Vỏ xe:\n•\tBảo vệ: Vỏ xe là lớp vỏ kim loại bao bọc toàn bộ khung xe, bảo vệ các bộ phận bên trong khỏi tác động của môi trường như mưa, nắng, bụi bẩn, va đập,...\n•\tThẩm mỹ: Vỏ xe góp phần tạo nên vẻ ngoài đẹp mắt cho xe, thể hiện cá tính và sở thích của người dùng.\n•\tKhí động học: Thiết kế khí động học của vỏ xe giúp giảm thiểu lực cản của gió, tiết kiệm nhiên liệu và tăng tốc độ.\n2. Cửa xe:\n•\tTiện nghi: Cửa xe giúp người lái và hành khách ra vào xe dễ dàng.\n•\tBảo vệ: Cửa xe đóng vai trò bảo vệ người ngồi trong xe khỏi các tác động bên ngoài như va đập, tiếng ồn,...\n•\tAn toàn: Cửa xe được trang bị các hệ thống an toàn như khóa cửa tự động, cửa sổ chống kẹt,...\n3. Kính xe:\n•\tQuan sát: Kính xe giúp người lái quan sát phía trước, hai bên và phía sau xe, đảm bảo an toàn khi lái xe.\n•\tBảo vệ: Kính xe bảo vệ người ngồi trong xe khỏi bụi bẩn, côn trùng, tia UV,...\n•\tThẩm mỹ: Kính xe góp phần tạo nên vẻ ngoài đẹp mắt cho xe.\n4. Đèn xe:\n•\tChiếu sáng: Đèn xe giúp người lái quan sát đường đi và các phương tiện khác trong điều kiện thiếu sáng hoặc trời tối.\n•\tBáo hiệu: Đèn xe giúp báo hiệu cho các phương tiện khác về sự hiện diện của xe, đảm bảo an toàn khi tham gia giao thông.\n•\tThẩm mỹ: Đèn xe góp phần tạo nên vẻ ngoài đẹp mắt cho xe.\n5. Gương xe:\n•\tQuan sát: Gương xe giúp người lái quan sát các phương tiện phía sau và hai bên xe, đảm bảo an toàn khi đổi làn đường, lùi xe,...\n•\tThẩm mỹ: Gương xe góp phần tạo nên vẻ ngoài đẹp mắt cho xe.\n6. Cản xe:\n•\tBảo vệ: Cản xe giúp giảm thiểu lực tác động khi va chạm, bảo vệ các bộ phận quan trọng của xe như động cơ, hộp số,...\n•\tThẩm mỹ: Cản xe góp phần tạo nên vẻ ngoài đẹp mắt cho xe.\n7. Lốp xe:\n•\tTiếp xúc: Lốp xe là bộ phận duy nhất tiếp xúc trực tiếp với mặt đường, giúp xe di chuyển.\n•\tHấp thụ xung lực: Lốp xe giúp hấp thụ xung lực từ mặt đường, mang lại cảm giác lái êm ái và thoải mái.\n•\tTruyền lực: Lốp xe truyền lực từ động cơ xuống mặt đường, giúp xe di chuyển.\n8. Các bộ phận khác:\nNgoài ra, ngoại thất ô tô còn bao gồm các bộ phận khác như antena, thanh giá nóc xe, logo xe,... mỗi bộ phận đều có chức năng riêng góp phần tạo nên sự hoàn chỉnh cho chiếc xe.",
                "images": [
                    "https://firebasestorage.googleapis.com/v0/b/automotive-fe630.appspot.com/o/images%2F9708b9c0-75fc-46c5-9750-77b4912e03b9_ascas.png?alt=media&token=6a927c80-dabd-4b16-a156-212337fbb1ba"
                ]
            }
        },
        {
            "id": "0bdeeb7d-f843-4137-9473-1a4a0a58f96b",
            "en": {
                "name": "Engine",
                "content": "",
                "mainComponents": "1.\tEngine: The part of a vehicle that generates power to move by using fuel or electricity.\n2.\tInternal combustion engine: A type of engine that uses fuel (gasoline, diesel) to burn inside cylinders to generate energy.\n3.\tGasoline engine: An engine that uses gasoline as fuel to operate.\n4.\tDiesel engine: An engine that uses diesel fuel to operate.\n5.\tEngine braking system: Components used to control and stop the engine, including disc brakes and drum brakes.\n6.\tEngine cooling system: System to maintain the operating temperature of the engine within a safe range.\n7.\tLubrication system: System to lubricate moving parts of the engine, reducing friction and wear.\n8.\tTorque: Rotational force generated by the engine and transmitted through the drivetrain to propel the vehicle.\n9.\tEngine power: The output power generated by the engine, often measured in horsepower or kilowatts.",
                "functions": "The car engine, also known as the internal combustion engine, is the most important part of the vehicle, with the role of converting chemical energy from fuel (gasoline, oil) into mechanical energy to drive the wheels. vehicle, helping the vehicle move.\n\nSpecifically, the engine operates according to the following principle:\n\n\tAir intake: The fuel and air mixture is fed into the combustion chamber.\n\tAir Compression: The fuel and air mixture is compressed by the piston.\n\tCombustion: The fuel and air mixture is ignited by an electric spark from the spark plug, creating high-pressure hot gases.\n\tExpansion: High-pressure hot gas pushes the piston down, creating thrust.\n\tExhaust gas: Exhaust gas after combustion is pushed out of the combustion chamber through the exhaust valve.\nThe thrust from the piston is transmitted to the crankshaft, then transmitted to the wheels through the transmission system, helping the vehicle move.",
                "images": [
                    "https://firebasestorage.googleapis.com/v0/b/automotive-fe630.appspot.com/o/images%2F0060525d-f5d1-4bf4-a19e-e59d2d2e673d_ascas.png?alt=media&token=a6d5b964-60d5-4829-be77-f90b51dfda93"
                ]
            },
            "vi": {
                "name": "Động cơ ô tô",
                "content": "",
                "mainComponents": "1.\tĐộng cơ: Phần của xe ô tô tạo ra sức mạnh để chuyển động bằng cách sử dụng nhiên liệu hoặc điện năng.\n2.\tĐộng cơ đốt trong: Loại động cơ sử dụng nhiên liệu (xăng, dầu diesel) để đốt cháy trong xi lanh để tạo ra năng lượng.\n3.\tĐộng cơ xăng: Loại động cơ sử dụng xăng làm nhiên liệu để hoạt động.\n4.\tĐộng cơ diesel: Loại động cơ sử dụng dầu diesel làm nhiên liệu để hoạt động.\n5.\tHệ thống phanh động cơ: Các bộ phận để kiểm soát và dừng lại động cơ, bao gồm phanh đĩa và phanh tang trống.\n6.\tHệ thống làm mát động cơ: Hệ thống để duy trì nhiệt độ hoạt động của động cơ trong phạm vi an toàn.\n7.\tHệ thống bôi trơn: Hệ thống để bôi trơn các bộ phận chuyển động của động cơ, giúp giảm ma sát và mài mòn.\n8.\tMô-men xoắn: Lực quay tạo ra bởi động cơ và truyền động qua hệ thống truyền động để đẩy xe chuyển động.\n9.\tCông suất động cơ: Sức mạnh sản sinh bởi động cơ, thường được đo bằng mã lực hoặc kilowatt.\n",
                "functions": "Động cơ ô tô, hay còn gọi là động cơ đốt trong, là bộ phận quan trọng nhất của xe, có vai trò chuyển hóa năng lượng hóa học từ nhiên liệu (xăng, dầu) thành năng lượng cơ học để truyền động cho bánh xe, giúp xe di chuyển.\nCụ thể, động cơ hoạt động theo nguyên tắc sau:\n1.\tNạp khí: Hỗn hợp nhiên liệu và không khí được nạp vào buồng đốt.\n2.\tNén khí: Hỗn hợp nhiên liệu và không khí bị nén lại bởi piston.\n3.\tĐốt cháy: Hỗn hợp nhiên liệu và không khí được đốt cháy bởi tia lửa điện từ bugi, tạo ra khí nóng có áp suất cao.\n4.\tGiãn nở: Khí nóng có áp suất cao đẩy piston xuống, tạo ra lực đẩy.\n5.\tThoát khí: Khí thải sau khi đốt cháy được đẩy ra khỏi buồng đốt qua van xả.\nLực đẩy từ piston được truyền đến trục khuỷu, sau đó được truyền đến bánh xe thông qua hệ thống truyền động, giúp xe di chuyển.",
                "images": [
                    "https://firebasestorage.googleapis.com/v0/b/automotive-fe630.appspot.com/o/images%2F0060525d-f5d1-4bf4-a19e-e59d2d2e673d_ascas.png?alt=media&token=a6d5b964-60d5-4829-be77-f90b51dfda93"
                ]
            }
        },
        {
            "id": "f135f457-29d5-4e54-8fbc-b2545522bd55",
            "en": {
                "name": "Transmission",
                "content": "",
                "mainComponents": "1.\tTransmission: A drivetrain component that converts and regulates the speed ratios of a vehicle.\n2.\tAutomatic transmission: A transmission system that automatically shifts gears based on vehicle speed and load.\n3.\tManual transmission: A transmission where the driver manually shifts gears using a gear stick and clutch pedal.\n4.\tClutch: A device used to disconnect and reconnect the engine from the transmission during gear changes.\n5.\tGear: Each speed ratio in the transmission, affecting vehicle performance and speed.\n6.\tDrivetrain: The system comprising the transmission, clutch, and driveshaft to transmit power from the engine to the wheels.\n7.\tGear ratio: The device in the transmission that changes ratios to match driving conditions.\n",
                "functions": "The engine gearbox, also known as the car gearbox, is an important part of the vehicle's transmission system, whose main functions are:\n\n1. Change the transmission ratio from engine to wheel:\n\n\tGear ratio: Gear ratio is the ratio between the number of revolutions of the motor shaft and the number of revolutions of the wheel.\n\tChanging speed: The gearbox allows changing the transmission ratio, thereby changing the speed of the wheels, allowing the vehicle to move at many different speeds suitable to operating conditions.\n\tChanging torque: The gearbox also helps change the torque transmitted to the wheels, helping the vehicle overcome difficult terrain or pull heavy loads.\n2. Change transmission direction:\n\n\tForward and reverse: The gearbox allows the transmission direction from the engine to the wheels, allowing the vehicle to move forward or backward.\n\tManual transmission: Manual transmission allows the driver to automatically select the transmission ratio appropriate to operating conditions.\n\tAutomatic transmission: Automatic transmission uses a torque converter to automatically adjust the transmission ratio to suit operating conditions.\n3. Disconnect the motor from the wheel when starting:\n\n\tDual-clutch transmission: The dual-clutch transmission allows the engine to be disconnected from the wheels when starting, helping to start the vehicle more smoothly and reduce engine wear.\n4. Engine protection:\n\n\tLimiting engine rpm: The gearbox helps limit excessive engine rpm, protecting the engine from damage.\nIn addition, the gearbox also has a number of other secondary functions such as:\n\n\tBrake system support: Some transmissions are equipped with an engine braking system, which helps support the main brake system, reduce brake pad wear and save fuel.\n\tProvide information to the driver: Some automatic transmissions display the current gear on the dashboard, helping the driver easily monitor the transmission's operating status.\nCommon gearbox types:\n\n\tManual transmission: Allows the driver to automatically select the transmission ratio.\n\tAutomatic transmission: Uses a torque converter to automatically adjust the transmission ratio.\n\tContinuously variable transmission (CVT): Continuously changes transmission ratios, helping the vehicle operate smoothly and save fuel.\nChoose the appropriate gearbox:\n\n\tChoosing the right gearbox depends on many factors such as:\n\tVehicle type: Vehicle size and type affect the type of transmission suitable.\n\tDriving style: Drivers who like to drive sporty or save fuel will need the right transmission.\n\tOperating conditions: Terrain and operating conditions also affect the appropriate gearbox type.\n",
                "images": [
                    "https://firebasestorage.googleapis.com/v0/b/automotive-fe630.appspot.com/o/images%2F05880268-1a57-43ed-808e-159cb5e17e2e_qwd.png?alt=media&token=b0fa0fba-2487-46f3-b740-2121d232bf1a"
                ]
            },
            "vi": {
                "name": "Hộp số ô tô ",
                "content": "",
                "mainComponents": "1.\tHộp số: Thiết bị truyền động để chuyển đổi và điều chỉnh số vận tốc của xe.\n2.\tHộp số tự động: Hộp số có khả năng tự động chuyển số dựa trên tốc độ và tải trọng của xe.\n3.\tHộp số sàn: Hộp số mà người lái xe phải thủ công chuyển đổi số vận tốc.\n4.\tLy hợp: Thiết bị dùng để ngắt kết nối và kết nối lại động cơ và hộp số trong quá trình thay đổi số.\n5.\tCầu số (Gear): Mỗi bộ số vận tốc trong hộp số, ảnh hưởng đến hiệu suất và tốc độ của xe.\n6.\tHệ thống truyền động: Hệ thống bao gồm hộp số, ly hợp và trục kết nối để truyền động từ động cơ tới bánh xe.\n7.\tBộ chuyển đổi tỷ số: Thiết bị trong hộp số để chuyển đổi tỷ số để phù hợp với điều kiện lái xe.\n",
                "functions": "Hộp số động cơ, hay còn gọi là hộp số xe ô tô, là bộ phận quan trọng trong hệ thống truyền động của xe, có chức năng chính là:\n1. Thay đổi tỷ số truyền động từ động cơ đến bánh xe:\n•\tTỷ số truyền động: Tỷ số truyền động là tỷ lệ giữa số vòng quay của trục động cơ và số vòng quay của bánh xe.\n•\tThay đổi tốc độ: Hộp số cho phép thay đổi tỷ số truyền động, từ đó thay đổi tốc độ của bánh xe, giúp xe có thể di chuyển với nhiều tốc độ khác nhau phù hợp với điều kiện vận hành.\n•\tThay đổi mô-men xoắn: Hộp số cũng giúp thay đổi mô-men xoắn truyền đến bánh xe, giúp xe có thể vượt qua các địa hình khó khăn hoặc kéo tải nặng.\n2. Chuyển hướng truyền động:\n•\tTiến và lùi: Hộp số cho phép chuyển hướng truyền động từ động cơ đến bánh xe, giúp xe có thể di chuyển tiến hoặc lùi.\n•\tHộp số số sàn: Hộp số số sàn cho phép người lái tự động tay lựa chọn tỷ số truyền động phù hợp với điều kiện vận hành.\n•\tHộp số tự động: Hộp số tự động sử dụng bộ biến mô để tự động điều chỉnh tỷ số truyền động phù hợp với điều kiện vận hành.\n3. Ngắt kết nối động cơ với bánh xe khi khởi động:\n•\tHộp số ly hợp kép: Hộp số ly hợp kép cho phép ngắt kết nối động cơ với bánh xe khi khởi động, giúp khởi động xe êm ái hơn và giảm hao mòn động cơ.\n4. Bảo vệ động cơ:\n•\tHạn chế vòng tua máy: Hộp số giúp hạn chế vòng tua máy quá cao, bảo vệ động cơ khỏi hư hỏng.\nNgoài ra, hộp số còn có một số chức năng phụ khác như:\n•\tHỗ trợ hệ thống phanh: Một số hộp số được trang bị hệ thống phanh động cơ, giúp hỗ trợ hệ thống phanh chính, giảm hao mòn má phanh và tiết kiệm nhiên liệu.\n•\tCung cấp thông tin cho người lái: Một số hộp số tự động hiển thị số hiện tại trên bảng điều khiển, giúp người lái dễ dàng theo dõi tình trạng hoạt động của hộp số.\nLoại hộp số phổ biến:\n•\tHộp số sàn: Cho phép người lái tự động tay lựa chọn tỷ số truyền động.\n•\tHộp số tự động: Sử dụng bộ biến mô để tự động điều chỉnh tỷ số truyền động.\n•\tHộp số vô cấp (CVT): Thay đổi tỷ số truyền động liên tục, giúp xe vận hành êm ái và tiết kiệm nhiên liệu.\nLựa chọn hộp số phù hợp:\nLựa chọn hộp số phù hợp phụ thuộc vào nhiều yếu tố như:\n•\tLoại xe: Kích thước và loại xe ảnh hưởng đến loại hộp số phù hợp.\n•\tPhong cách lái xe: Người lái thích lái xe thể thao hay tiết kiệm nhiên liệu sẽ cần hộp số phù hợp.\n•\tĐiều kiện vận hành: Địa hình và điều kiện vận hành cũng ảnh hưởng đến loại hộp số phù hợp.\n",
                "images": [
                    "https://firebasestorage.googleapis.com/v0/b/automotive-fe630.appspot.com/o/images%2F05880268-1a57-43ed-808e-159cb5e17e2e_qwd.png?alt=media&token=b0fa0fba-2487-46f3-b740-2121d232bf1a"
                ]
            }
        },
        {
            "id": "7b8566d8-0155-4512-bf65-abeb418710c5",
            "en": {
                "name": "Automotive Cooling System",
                "content": "The cooling system in a car is crucial for maintaining optimal engine temperature and performance. It consists of several key components that work together to dissipate heat generated by the engine during operation.",
                "mainComponents": "1.\tRadiator: The radiator is a heat exchanger that uses coolant to transfer heat away from the engine. It consists of a series of tubes and fins through which air passes, cooling the liquid coolant circulated from the engine.\n2.\tCoolant: A mixture of water and antifreeze, coolant absorbs heat from the engine and transfers it to the radiator. It also prevents freezing in cold temperatures and protects against corrosion.\n3.\tWater Pump: The water pump circulates coolant throughout the engine and radiator. It ensures a constant flow of coolant to maintain consistent engine temperature.\n4.\tThermostat: The thermostat regulates coolant flow based on engine temperature. It opens and closes to allow coolant into the radiator once the engine reaches operating temperature.\n5.\tFans: Electric fans or a fan clutch help cool the radiator by pulling air through it when the car is stationary or at low speeds. This enhances cooling efficiency during idle or slow driving.\n6.\tHoses and Pipes: These transport coolant between the radiator, engine, and other cooling system components. They need to be inspected regularly for leaks or wear.\n7.\tExpansion Tank: Also known as the coolant reservoir, it provides a space for coolant expansion and contraction as temperatures fluctuate. This helps maintain proper coolant levels.\nMain functions of cooling system:\n\nReduce engine temperature: The cooling system helps reduce engine temperature to a suitable level, ensuring the engine operates stably and efficiently.\nPrevent engine overheating: Engine overheating can lead to serious damage, so the cooling system plays an important role in preventing engine overheating.\nReduce engine wear: High temperatures can increase engine wear, so the cooling system helps reduce engine wear and prolong engine life.\nEnvironmental protection: An overheated engine can emit more harmful gases, so the cooling system helps protect the environment by minimizing harmful emissions from the engine.\n",
                "functions": "",
                "images": [
                    "https://firebasestorage.googleapis.com/v0/b/automotive-fe630.appspot.com/o/images%2F55eab97c-7468-4cc2-9f2b-d5f17aedc739_qwcwwdwax.png?alt=media&token=baac30dc-8750-4dcf-abc8-3e7770ca64b0"
                ]
            },
            "vi": {
                "name": "HỆ THỐNG LÀM MÁT",
                "content": "Hệ thống làm mát trên ô tô rất quan trọng để duy trì nhiệt độ và hiệu suất hoạt động của động cơ. Nó bao gồm một số thành phần chính làm việc cùng nhau để xua tan nhiệt sinh ra trong quá trình vận hành của động cơ.",
                "mainComponents": "1.\tBộ Tản Nhiệt (Radiator): Bộ tản nhiệt là một thiết bị trao đổi nhiệt sử dụng dung dịch làm mát để lấy đi nhiệt từ động cơ. Nó bao gồm một loạt ống và lá nhôm, qua đó không khí lưu thông để làm lạnh dung dịch làm mát chảy từ động cơ.\n2.\tDung Dịch Làm Mát (Coolant): Là hỗn hợp nước và chất chống đông, dung dịch làm mát hút nhiệt từ động cơ và chuyển nó đến bộ tản nhiệt. Nó cũng ngăn ngừa đông cứng ở nhiệt độ thấp và bảo vệ chống lại sự ăn mòn.\n3.\tBơm Nước (Water Pump): Bơm nước lưu thông dung dịch làm mát xung quanh động cơ và bộ tản nhiệt. Nó đảm bảo sự lưu thông liên tục của dung dịch làm mát để duy trì nhiệt độ động cơ ổn định.\n4.\tVan Thermostat: Van thermostat điều chỉnh lưu thông dung dịch làm mát dựa trên nhiệt độ động cơ. Nó mở và đóng để cho phép dung dịch vào bộ tản nhiệt khi động cơ đạt nhiệt độ vận hành.\n5.\tQuạt (Fans): Quạt điện hoặc hơi quạt giúp làm mát bộ tản nhiệt bằng cách hút không khí qua nó khi xe đứng yên hoặc di chuyển chậm. Điều này tăng cường hiệu suất làm mát trong thời gian đỗ xe hoặc lái xe chậm.\n6.\tỐng và Dây Dẫn (Hoses and Pipes): Chúng chuyển chất làm mát giữa bộ tản nhiệt, động cơ và các thành phần hệ thống làm mát khác. Cần kiểm tra thường xuyên để phát hiện rò rỉ hoặc mòn.\n7.\tBình Mở Rộng (Expansion Tank): Còn được gọi là bình chứa dung dịch làm mát, nó cung cấp không gian cho sự mở rộng và co lại của dung dịch làm mát khi nhiệt độ dao động. Điều này giúp duy trì mức độ dung dịch làm mát phù hợp.\n",
                "functions": "1.\tGiảm nhiệt độ động cơ: Hệ thống làm mát giúp giảm nhiệt độ động cơ xuống mức phù hợp, đảm bảo động cơ hoạt động ổn định và hiệu quả.\n2.\tNgăn ngừa động cơ quá nhiệt: Động cơ quá nhiệt có thể dẫn đến hư hỏng nghiêm trọng, do đó hệ thống làm mát đóng vai trò quan trọng trong việc ngăn ngừa động cơ quá nhiệt.\n3.\tGiảm hao mòn động cơ: Nhiệt độ cao có thể làm tăng hao mòn động cơ, do đó hệ thống làm mát giúp giảm hao mòn động cơ và kéo dài tuổi thọ cho động cơ.\n4.\tBảo vệ môi trường: Động cơ quá nhiệt có thể thải ra nhiều khí độc hại hơn, do đó hệ thống làm mát giúp bảo vệ môi trường bằng cách giảm thiểu khí thải độc hại từ động cơ.",
                "images": [
                    "https://firebasestorage.googleapis.com/v0/b/automotive-fe630.appspot.com/o/images%2F55eab97c-7468-4cc2-9f2b-d5f17aedc739_qwcwwdwax.png?alt=media&token=baac30dc-8750-4dcf-abc8-3e7770ca64b0"
                ]
            }
        },
        {
            "id": "dff1ae07-bd11-4d73-94be-1af7a375d78e",
            "en": {
                "name": "Automotive Lubrication System",
                "content": "The lubrication system in a car is essential for reducing friction between moving parts, preventing wear and tear, and ensuring smooth operation of the engine and other components. Here are the key components of the automotive lubrication system",
                "mainComponents": "1.\tEngine Oil: Engine oil is the primary lubricant used in internal combustion engines. It lubricates moving parts such as the pistons, crankshaft, and camshaft, reducing friction and heat.\n2.\tOil Pump: The oil pump circulates engine oil throughout the engine to ensure all moving parts are adequately lubricated. It maintains oil pressure to prevent metal-to-metal contact and damage.\n3.\tOil Filter: The oil filter removes contaminants such as dirt, metal particles, and sludge from the engine oil. It helps maintain oil cleanliness and prolongs engine life.\n4.\tOil Pan: Also known as the sump, the oil pan stores engine oil and provides a reservoir for the oil pump to draw from. It also contains the oil pickup tube that directs oil to the pump.\n5.\tOil Cooler: In some vehicles, an oil cooler helps regulate engine oil temperature by cooling it down. This is especially important in high-performance engines or under heavy loads.\n6.\tOil Pressure Sensor: The oil pressure sensor monitors oil pressure in the lubrication system. It alerts the driver if oil pressure drops below safe levels, indicating a potential problem.\n7.\tSeals and Gaskets: These prevent oil leaks and ensure that oil remains contained within the lubrication system, maintaining proper lubrication levels.\n",
                "functions": "\tGiảm ma sát: Hệ thống bôi trơn giúp giảm ma sát giữa các bề mặt tiếp xúc, giúp máy móc hoạt động êm ái, nhẹ nhàng và tiết kiệm năng lượng.\n\tLàm mát: Hệ thống bôi trơn giúp làm mát các bộ phận chuyển động bằng cách hấp thụ nhiệt sinh ra do ma sát và truyền nhiệt ra ngoài môi trường.\n\tBảo vệ: Hệ thống bôi trơn giúp bảo vệ các bề mặt khỏi mài mòn, rỉ sét và ăn mòn.\n\tKéo dài tuổi thọ: Hệ thống bôi trơn giúp kéo dài tuổi thọ cho máy móc và thiết bị bằng cách giảm ma sát, làm mát và bảo vệ các bộ phận chuyển động.\n",
                "images": [
                    "https://firebasestorage.googleapis.com/v0/b/automotive-fe630.appspot.com/o/images%2F55887269-0d51-4d33-9357-a33322b8edcd_qcsq.png?alt=media&token=79e012f2-8940-490e-804c-0dd845e895e0"
                ]
            },
            "vi": {
                "name": "HỆ THỐNG BÔI TRƠN",
                "content": "Hệ thống bôi trơn trên ô tô rất quan trọng để giảm ma sát giữa các bộ phận chuyển động, ngăn ngừa mài mòn và đảm bảo hoạt động êm ái của động cơ và các thành phần khác. Dưới đây là các thành phần chính của hệ thống bôi trơn ô tô",
                "mainComponents": "1.\tDầu Động Cơ (Engine Oil): Dầu động cơ là chất bôi trơn chính được sử dụng trong động cơ đốt trong. Nó bôi trơn các bộ phận chuyển động như piston, trục khuỷu và trục cam, giảm ma sát và nhiệt.\n2.\tBơm Dầu (Oil Pump): Bơm dầu lưu thông dầu động cơ khắp nơi để đảm bảo tất cả các bộ phận chuyển động được bôi trơn đầy đủ. Nó duy trì áp suất dầu để ngăn ngừa tiếp xúc kim loại với kim loại và hư hỏng.\n3.\tBộ Lọc Dầu (Oil Filter): Bộ lọc dầu loại bỏ các tạp chất như bụi, hạt kim loại và phế phẩm từ dầu động cơ. Nó giúp duy trì sạch dầu và kéo dài tuổi thọ động cơ.\n\n4.\tXô Dầu (Oil Pan): Còn được gọi là xô chứa dầu, xô dầu chứa dầu động cơ và cung cấp một bể chứa cho bơm dầu hút từ. Nó cũng chứa ống hút dầu đẩy dầu đến bơm.\n5.\tBộ Làm Mát Dầu (Oil Cooler): Ở một số xe, bộ làm mát dầu giúp điều tiết nhiệt độ dầu động cơ bằng cách làm lạnh nó xuống. Điều này đặc biệt quan trọng đối với các động cơ hoạt động mạnh hoặc trong điều kiện làm việc nặng.\n6.\tCảm Biến Áp Suất Dầu (Oil Pressure Sensor): Cảm biến áp suất dầu giám sát áp suất dầu trong hệ thống bôi trơn. Nó cảnh báo tài xế nếu áp suất dầu giảm xuống mức không an toàn, chỉ ra một vấn đề tiềm ẩn.\n7.\tPhớt và Măng Xông (Seals and Gaskets): Những chi tiết này ngăn ngừa rò rỉ dầu và đảm bảo dầu được giữ trong hệ thống bôi trơn, duy trì mức độ bôi trơn phù hợp.",
                "functions": "\tReduce friction: The lubrication system helps reduce friction between contact surfaces, helping machines operate smoothly, gently and save energy.\n\tCooling: The lubrication system helps cool moving parts by absorbing heat generated by friction and transferring it to the environment.\n\tProtection: Lubrication system helps protect surfaces from wear, rust and corrosion.\n\tExtends life: Lubrication systems help extend the life of machinery and equipment by reducing friction, cooling and protecting moving parts.",
                "images": [
                    "https://firebasestorage.googleapis.com/v0/b/automotive-fe630.appspot.com/o/images%2F55887269-0d51-4d33-9357-a33322b8edcd_qcsq.png?alt=media&token=79e012f2-8940-490e-804c-0dd845e895e0"
                ]
            }
        },
        {
            "id": "256f3067-9ae7-46bb-b52b-c13bdfad9c14",
            "en": {
                "name": "Automotive Chassis System",
                "content": "The chassis system of a vehicle is the framework that supports various mechanical components and provides structural integrity. It includes several critical components that contribute to the vehicle's stability, handling, and safety",
                "mainComponents": "1.\tFrame: The frame forms the basic structure of the chassis, providing rigidity and strength to support the vehicle's weight and absorb road shocks.\n2.\tSuspension System: The suspension system includes springs, shock absorbers (dampers), control arms, and other components that connect the wheels to the chassis. It absorbs bumps and vibrations from the road, enhancing ride comfort and stability.\n3.\tSteering System: The steering system allows the driver to control the direction of the vehicle. It includes components such as the steering wheel, steering column, steering gear, and tie rods.\n4.\tBraking System: The braking system consists of components such as brake discs, brake pads, brake calipers, and brake lines. It enables the vehicle to slow down or stop safely.\n5.\tWheels and Tires: Wheels are mounted on axles connected to the chassis, and tires provide traction and grip on the road surface. Proper maintenance of wheels and tires is crucial for safe driving.\n6.\tChassis Control Systems: Modern vehicles often include electronic chassis control systems like ABS (Anti-lock Braking System), ESC (Electronic Stability Control), and traction control. These systems enhance vehicle stability and safety in various driving conditions.\n7.\tSubframe: In some vehicles, a subframe is used to support specific components such as the engine, transmission, or suspension. It improves structural rigidity and simplifies maintenance.\n",
                "functions": "1.\tBearing: The chassis system bears the entire weight of the vehicle, engine, gearbox, transmission system, suspension and other components.\n2.\tProtection: The chassis system protects vehicle occupants from impact in the event of an accident.\n3.\tMinimize vibration: The chassis system helps minimize vibration and impact of the vehicle when traveling on uneven terrain, bringing a smooth and comfortable feeling to the occupants.\n4.\tControlling the direction of movement: The chassis system helps control the direction of the vehicle according to the driver's wishes.\n5.\tSlow down and stop the vehicle: The chassis system helps slow down or stop the vehicle safely.",
                "images": [
                    "https://firebasestorage.googleapis.com/v0/b/automotive-fe630.appspot.com/o/images%2F75b4ffb3-f319-4af4-9c17-34ef7e3b33f5_qwd.png?alt=media&token=18f86b4b-fc45-4afb-a659-cdd07d6e2e85"
                ]
            },
            "vi": {
                "name": "HỆ THỐNG KHUNG GẦM",
                "content": "Hệ thống khung gầm của một chiếc xe là bộ khung hỗ trợ các thành phần cơ khí và cung cấp tính cơ cấu. Nó bao gồm một số thành phần quan trọng góp phần vào sự ổn định, xử lý và an toàn của xe",
                "mainComponents": "1.\tKhung Xe (Frame): Khung xe hình thành cấu trúc cơ bản của khung gầm, cung cấp độ cứng và sức mạnh để chịu trọng lượng của xe và hút sốc từ đường.\n2.\tHệ Thống Treo (Suspension System): Hệ thống treo bao gồm lò xo, bộ giảm xóc (dampers), càng lá và các thành phần khác kết nối bánh xe với khung gầm. Nó hấp thụ những cú sốc và rung động từ đường, nâng cao sự thoải mái khi lái và ổn định của xe.\n3.\tHệ Thống Lái (Steering System): Hệ thống lái cho phép tài xế điều khiển hướng đi của xe. Nó bao gồm các thành phần như vô lăng, trục lái, hộp số lái và thanh kết nối.\n4.\tHệ Thống Phanh (Braking System): Hệ thống phanh bao gồm các thành phần như đĩa phanh, bố thắng, bố xi lanh phanh và ống dẫn phanh. Nó cho phép xe chậm lại hoặc dừng an toàn.\n5.\tBánh Xe và Lốp Xe (Wheels and Tires): Bánh xe được gắn trên trục kết nối với khung gầm và lốp cung cấp ma sát và bám đường. Bảo dưỡng đúng đắn bánh xe và lốp xe là rất quan trọng để lái xe an toàn.\n6.\tHệ Thống Điều Khiển Khung Gầm (Chassis Control Systems): Xe hơi hiện đại thường bao gồm các hệ thống điều khiển khung gầm điện tử như ABS (Hệ thống chống bó cứng phanh), ESC (Hệ thống kiểm soát ổn định điện tử) và kiểm soát lực kéo. Các hệ thống này tăng cường sự ổn định và an toàn của xe trong các điều kiện lái khác nhau.\n7.\tKhung Phụ (Subframe): Trong một số xe, khung phụ được sử dụng để hỗ trợ các thành phần như động cơ, hộp số hoặc hệ thống treo. Nó cải thiện tính cứng vững cấu trúc và đơn giản hóa bảo trì.",
                "functions": "1.\tChịu lực: Hệ thống khung gầm chịu toàn bộ trọng lượng của xe, động cơ, hộp số, hệ thống truyền động, hệ thống treo và các bộ phận khác.\n2.\tBảo vệ: Hệ thống khung gầm bảo vệ người ngồi trong xe khỏi va đập trong trường hợp xảy ra tai nạn.\n3.\tGiảm thiểu rung lắc: Hệ thống khung gầm giúp giảm thiểu rung lắc và va đập của xe khi di chuyển trên địa hình không bằng phẳng, mang lại cảm giác êm ái và thoải mái cho người ngồi trong xe.\n4.\tĐiều khiển hướng di chuyển: Hệ thống khung gầm giúp điều khiển hướng di chuyển của xe theo ý muốn của người lái.\n5.\tGiảm tốc độ và dừng xe: Hệ thống khung gầm giúp giảm tốc độ hoặc dừng xe một cách an toàn.",
                "images": [
                    "https://firebasestorage.googleapis.com/v0/b/automotive-fe630.appspot.com/o/images%2F75b4ffb3-f319-4af4-9c17-34ef7e3b33f5_qwd.png?alt=media&token=18f86b4b-fc45-4afb-a659-cdd07d6e2e85"
                ]
            }
        }
    ]
}